{"id":null,"metadata":{"source":"https://myokotourism.com/contact/","title":"Contact Us","description":"We are here to help you with your trip to Myoko. Feel free to contact us via e-mail and we will do our best to help you.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenContact UsOpening hours: 9:00 - 17:00 (everyday)0255-86-3911\n[email protected]\n949-2106, Niigata Ken, Myoko City, Taguchi 309-1\n \n\n\n\n\n\n\n\n\n\n\n\n\nSend\n \n\n\nPlease note that a lot of information can be found on this website. If you are enquiring about bus times etc that are obviously listed on the site we may not reply during busy periods due to the volume of enquiries we receive. We also do not take hotel bookings or make reservations for taxis. E-mails about these will be ignored.Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/onsen-in-myoko/","title":"Onsen in Myoko - Myoko Tourism","description":"Myoko has 7 different onsen areas. This makes Myoko an amazing area for enjoying Japanese hotspring baths.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nOnsen in Myoko - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMyoko Kogen Hot Spring Village7-5-3 Hot SpringsThe seven hot springs (Akakura, Shin-Akakura, Ikenotaira, Myoko, Suginosawa, Seki, and Tsubame) at the foot of Mt.Myoko source there water from deep with in the mountain.Akakura Onsen and Shin-Akakura Onsen use the same Kita Jigokudani as their source, and Myoko Onsen and Ikenotaira Onsen use the Minami Jigokudani as their source. There are five sources of hot spring in total allowing you to enjoy five different spring qualities and effects.The color of the hot springs is also unique. In addition to the transparent hot springs, you can experience three different colors: the milky white Tsubame hot springs, the reddish brown Seki hot springs, and the black colored Ikenotaira hot springs. In addition to day-trip bathing facilities, there are inns where you can stop by and take a bath. The famous outdoor Tsubame Onsen baths are also free to use.Public BathsThere is generally one public bath in each area of Myoko Kogen. Public baths are cheaper and accessible to everybody. They will also be frequented by locals and Japanese visitors will also often by them after at the end of their day.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nTaki no yuAkakura\n10:00～16:00\nA 500円C 350円\nOutdoor onlyClosed in winter\n\n\nOoyuMyoko Onsen\n13:00～19:30closed Tuesday\nA 400円C 200円\n\n\n\nFureai KaikanIkenotaira\n8:30～21:00closed Thursday\nA 450円C 250円\n\n\n\nAlpen Blick Spa\n9:00～22:00closed Tuesday\n800円\nOutdoor bath\n\n\nNaena no yuSuginosawa\n11:00～19:00closed Wednesday\nA 500円C 300円\n\n\n\n\nAkakura footbathAkakura Onsen Taki no yuAkakura OnsenLocated at an altitude of about 800m, Akakura Onsen is the largest hot spring resort in the Myoko Kogen hot spring area. The hot water of Akakura Onsen is a renowned and famous hot spring that combines two types of hot spring water. It has an established reputation for its quality and healing properties. Akakura Onsen was opened in 1816 by Sakakibara, the feudal lord of the Takada domain.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nHotel Taiko\n11:30～21:00\nA 1,100円C 880円\nOutdoor bath (closed weekdays)\n\n\nWakui Hotel\n15:00～20:00\nA 600円C 350円\n\n\n\nAkakura Hotel\n9:00～21:00\nA 1000円C 500円\nOutdoor bath\n\n\nKogakuro\n15:00～19:00\nA 800円C 400円\nOutdoor bath, closed in winter\n\n\nTaizan\n13:00～21:00\nA 600円C 400円\nOutdoor bath, closed in winter\n\n\nPark Hotel\n15:00～18:00\nA 500円C 300円\n\n\n\n\nShin AkakuraShin-Akakura Onsen uses the same hot water source as Akakura Onsen. The mineral rich waters are great for the skin and contain other healing properties.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nAkakura Yours Inn\nreservation required\nA 500円C 350円\n\n\n\n\nTsubame OnsenAt an altitude of about 1,100m, Tsubame Onsen is located at the highest point in the Myoko Kogen hot spring village. It is said that the Tsubame Onsen was named after a flock of rock swallows that once flew about. Full-scale development began in the 8th year of the Meiji era, but it is said to have been discovered by Kobo Daishi. A hot spring for beautiful skin (Triple Bijin-yu) it contains three minerals that have skin-beautifying effects. It is also said to be the hidden hot spring of Kenshin Uesugi. It is characterized by \"white Yuka\" its milky white waters. The free open-air baths “Ougon-no-Yu (separate for men and women)” and “Kawara-no-Yu (mixed bathing)” are popular hidden hot spring spots. Many climbers use it on their way back from climbing Myoko.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nHotel Hanabun\n11:00～18:00\nA 500円C 300円\nFemale only outdoor bath\n\n\nHotel Iwatoya\n12:00～21:00\nA 700円C 500円\nOutdoor bath\n\n\nOugon no Yu\nalways open\nfree\nOutdoor bath, closed in winter\n\n\nKawara no Yu\nnow open\nfree\nOutdoor bath, closed in winter\n\n\n\nRyokan HanabunHotel IwatoyaIkenotaira OnsenIkenotaira shares its source with Myoko onsen area. Landmarks hot springs have a black coloured water. This comes from the heavy mineral content that floats in the clear waters. Landmark is open 24hrs during the winter season and also offers an internet cafe area, pool tables, table tennis and other amusements. You pay per hour for free use of all the facilities. The brand new Lime Resort Myoko have also opened their beautiful new baths to the public. They have a variety of different indoor baths as well as an outdoor bath. Fureai Kaikan is run by Myoko City as a public bath and is located down the hill from Landmark and the ski resort.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nAlpen Blick Spa\n9:00～22:00Closed Tuesday\n800円\nOutdoor bath\n\n\nLime Resort Myoko\n15:00～21:00\nA 1000円C 500円\nOutdoor bathtowel rental available\n\n\nFureai Kaikan\n8:30～21:00Closed Thursday\nA 450円C 250円\n\n\n\nHotel Alpen Blick\n12:00～19:00\nA 700円C 500円\nOutdoor bath\n\n\n\nSuginosawa OnsenSuginosawa is the newest hot spring area in Myoko. The clear mineral rich waters offer great benefits to the skin. The hot spring in Suginosawa is a public bath called Naena no yu which is available to all. It is closed on Wednesday but during the winter season it is open everyday.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nNaena no yu\n11:00～19:00closed Wednesday\nA 500円C 300円\n\n\n\n\nMyoko OnsenMyoko Onsen is just 15 minutes on foot or 3 minutes by car from Myokokogen Station. This hot spring area shares its source with Ikenotaira Onsen and provides a soft and gentle water that is great for the skin.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nKofukan\n12:00～20:00\nA 700円C 500円\nOutdoor bath, closed in winter\n\n\nOoyu\n13:00～19:30closed Tuesday\nA 400円C 200円\n\n\n\n\nSeki OnsenSeki Onsen opened in 1729 and is the oldest of all hot springs in Myoko. The traditional village area still carries the atmosphere of past times. The area is popular in winter as the small Seki Onsen ski resort is famous for its deep powder snows. The reddish water gets its colour from the high iron content in the water. The iron has a heating effect on the body which is particularly pleasant in winter months. The outdoor baths of the hotels are closed in winter.\n\n\n\nName\nOpen\nA (Adult)C (Child)\nInfo\n\n\n\n\nAsahiya\n9:00～17:00\nA 500円C 300円\nOutdoor bath\n\n\nNakamuraya\n9:00～17:00\nA 500円C 200円\nOutdoor bath\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/sea-to-summit/","title":"2018 Sea to Summit","description":"This year the 3rd Sea to Summit event was held jointly in Myoko and Naganos Shinanomachi. The event is a 3-stage challenge. Kayak Nojiri lake, cycle to Sasagamine then climb Mt Hiuchi.","language":"en-US"},"page_content":"\n\n\n\n\n\n\n2018 Sea to Summit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSea to SummitUpdated onJuly 25, 2018Places\n\n\n2019 Sea to Summit event.\nSea to Summit Event\nThe Sea to Summit event is held each year in Myoko and Nagano Shinanomachi. The event is a 3-stage challenge. It is an environmental event in which participants kayak around Lake Nojiri, then cycle through the countryside up to Sasagamine and then finally hike up to the peak of Mt Hiuchi. \nThe event is aimed to make participants reflect on the importance of the natural world and the beauty and importance of nature. The event is more of a personal challenge and experience rather than a race. Many people also form teams and a different person can do each stage of the event. This means that most people of reasonable fitness should be able to take part.  \nFor more info in English please check the Montbell official page here.\nThe official Japanese sea to summit page is here.\nThe Journey\nIn the early hours of the morning as the sun is just starting to rise the competitors take to the waters of Lake Nojiri. They kayak around the central island and back again. Despite the distance the fastest competitors can complete this part of the event in under 30 minutes. The early morning sun reflecting on the lake as the participants set out is absolutely beautiful.\nEarly morning kayak around Nojiri lake\nThe second stage is to cycle from Lake Nojiri to the Sasagamine plateau. The ride is all up hill and while providing spectacular views is undoubtedly an extremely tough challenge, especially if it is a hot day. There are water drinking stations positioned along the route where participants can stop for refreshments and snacks.\nCycling uphill to Sasagamine.\nUpon reaching Sasagamine participants leave their bike at the rest stop, take some of the drinks and food provided by event staff and then start the climb to the peak of Mt Hiuchi.\nThis is a 9km hike often in 30-degree heat and can be an extreme challenge if you don’t pace yourself properly, particularly for those going for a fast finish time. \nstarting the climbAt raicho daira near the peak\nThe event allows for team work, so many people split the three parts of the event between three team members. Of course, those looking for the toughest challenge can complete all three parts of the event by themselves.\nAll the compeditors gather at the peakThe top of Mt HiuchiAt the finish lineEnjoying the view\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/okakura-tenshin-monument/","title":"Okakura Tenshin Monument - Myoko Tourism","description":"A serene garden and monument to the renowned art historian and philosopher, Okakura Tenshin.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nOkakura Tenshin Monument - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenOkakura Tenshin MonumentUpdated onJuly 29, 2023Places\nJust a short walk, less than a kilometer away from Akakura Hot Spring, lies a serene and secluded garden adorned with a six-sided building at its center. Known as the Rokkakudo, meaning “hexagonal hall,” this structure was constructed in 1959 as a tribute to the renowned art historian and philosopher, Okakura Tenshin (1862–1913). If you have ever marveled at a Japanese woodblock print or been captivated by the beauty of a traditional Japanese tea ceremony, you may owe a part of that experience to Okakura and his influential writings.\nBorn into a family involved in the silk trade in Yokohama, Okakura learned English at a local mission school before delving into the study of Chinese classics at Choenji Temple. His academic journey led him to Tokyo Kaisei School, one of the two colleges that later merged to form the prestigious University of Tokyo. Initially, his bachelor’s thesis, titled “Theory of State,” met an unfortunate fate when it was destroyed during a dispute with his wife. Undeterred, Okakura swiftly penned his second attempt, “Theory of Art,” in a mere two weeks, a work that would shape his future endeavors.\nThroughout his illustrious career, Okakura dedicated himself to preserving and promoting traditional Japanese art in the face of the country’s rapid modernization and the influence of the West. He became part of the Ministry of Education and established several art institutes to foster art education. In 1904, he was appointed as a curator at the Boston Museum of Fine Arts, expanding his impact beyond Japan’s borders. His written works in English, including “The Book of Tea” (1906), played a pivotal role in introducing the profound aesthetics of the Japanese tea ceremony to the Western world.\nIn the later years of his life, Okakura often sought solace in his mountain villa at Akakura Hot Spring, where he eventually passed away in 1913. To commemorate his significant contributions to art and culture, the Rokkakudo and its surrounding monuments were erected. Within the hall, a precious gold-enameled bust of Okakura is enshrined, honoring his enduring legacy.\nPlease note that the Rokkakudo park remains closed during winter due to heavy snowfall.\n\n\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/lake-nojiri/","title":"Lake Nojiri","description":"Lake Nojiri is a part of the Myoko Togakushi Renzan National Park. You can try kayaking, canoeing, SUP, banana boating and more on the lake.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nLake Nojiri\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenLake NojiriUpdated onJuly 7, 2019Places\nBeautiful Lake Nojiri\nLake Nojiri is a part of the Myoko Togakushi Renzan National Park. The lake lies just across the border of Myoko in Shinanomachi in Nagano Prefecture. The lake is a 5-minute drive from Myoko and is easily with in cycling distance. There is a route around the whole lake which makes it an excellent area to cycle. Situated in the middle of the lake is Biwa Island. On the island is Uga Shrine which was founded in 730AD. The main sanctuary area of the shrine was constructed in 1655. The island can be reached by the small ferry that travels the lake or you can canoe or peddle boat out to the island.\n\n\n\n\n\nThe main season of water activities runs from May to October. During this time, you can try many different water activities. On offer is canoeing and kayaking, SUP stand up paddling, wakeboarding, windsurfing, banana boating and of course the pleasure cruise on the small ferry. \nYou can rent paddle boats and canoes from shops around the lake. If you would prefer a lesson and guide, one of the most popular places is Guest house LAMP. They offer guides for all activities on the lake.\nThe lake also hosts many sporting events. In the beginning of July there is the Nojiriko Triathlon. Also in July is the famous Sea to Summit event. Participants first kayak around the island before cycling to Sasagamine and then climbing to the peak of Mt Hiuchi.\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/naena-falls/","title":"Naena Waterfall","description":"Naena waterfall is one of the most spectacular places in Myoko. It is one of Japans 100 most famous waterfalls and is a place everyone should visit.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nNaena Waterfall\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenNaena WaterfallA stunning thundering 55m waterfall that is part of the Myoko-Togakushi Renzan National Park and one of Japan’s Top 100 Waterfalls.\nUpdated onJuly 24, 2018Places\nAbout  Naena Waterfall\nNaena Waterfall is an impressive 55m waterfall and is part of the Myoko-Togakushi renzan National Park as well as one of Japan’s Top 100 Waterfalls. It is framed by a steep basalt wall on each side and the thundering water crashes on to the large boulders below. This thundering sounds gives the waterfall its nickname “earthquake waterfall”\nThe waterfall is a 15 minute walk from the carpark area. The walk is not difficult and is level with a gentle incline for most of the way. When the ground is wet it can be slippery so you should go in suitable footwear and mind your step.\nNaena Waterfall in spring\nIn spring the snow melt from the mountain flows down and causes the volume of water to increase dramatically. The amount of water that comes down at this time is truly impressive. The thundering noise of the water and the spray from the waterfall is almost frightening as you cross the bridge in front of it. \nAfter the snow has melted and before the greenery returns the waterfall looks very bleak and barren, coupled with the volume of water in this season, the waterfall looks and feels very imposing. It is a great season to visit as you an truly experience the thundering sound that gives the waterfall its nickname. \n\n\n\n\n\n\n\n\nNaena Waterfall in summer\nIn the summer months, everything is lush and green, the water is calmer and you can climb over the large boulders in the river bed. The area is a great place to visit in the summer heat. The spray from the waterfall is refreshing and the area around the waterfall is a lot cooler. It is the prefect place to relax and refresh if the humidity and heat of the Japanese summer is getting to you. \n\n\n\n\n\n\n\n\nNaena Waterfall in autumn\nAutumn is a beautiful season as the leaves start to turn shades of red, yellow and orange. Autumn would probably be the most beautiful season to visit Naena waterfall. All of the trees that sit a top of the waterfall change their colours and it makes a spectacular sight. The area can get busy in this season as many visitors head to the waterfall during the peak koyo (autumn leaves) season.\nThe autumn colours are stunning.\nNaena Waterfall in winter\nIn winter the area isn’t officially open. As a result the road leading to the car park isn’t cleared so the whole area is buried under snow. However when the weather is good it is possible to head to the area with a guide on snowshoe. You can find more info about our winter tour here. \nIf you are an experienced snowshoer you could make the trip yourself. If you choose to do so you should note that the bridges and stairs will likely be blocked with snow, making them possibly impassable and definitely dangerous to cross. For this reason we suggest all visitors use a local guide who can choose the best conditions to head to the area and also know the risks involved.\nBeautiful in winter but difficult to reach.\nFood\nThe restaurants are found above the car park area before you begin your walk to the waterfall. The main restaurant (Naena taki restaurant) serves a variety of food. Their most popular dish is called nagashi somen. This is a thin type of noodle that you place at the top of a water spout and the noodles then flow down a pipe with the water and you catch them with your chop sticks. They also have a variety of tempura and fish dishes.\nNagashi somen – adding noodles to the running water.\nCafe Grand sells amazing ice cream. There are a variety of toppings that you can help yourself to. They also offer coffee and other drinks. I always make sure to get a soft cream after walking back from the waterfall. On a summer day, it’s great to sit in the shade and try out all the different flavour toppings.\nGetting there\nIn 2016, a new road was constructed that now leads directly to the carpark area. If you have your own transport it very easy to reach and is sign posted from Suginosawa. If you plan to head there by bus then please refer to the times below. ‎\nCLICK HERE for the local bus times.\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/kanzuri-factory/","title":"Kanzuri Factory Tour","description":"Take a tour of the Kanzuri spice factory in Myoko. Learn about how this famous local spice is produced and learn about its history.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nKanzuri Factory Tour\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenKanzuri FactoryUpdated onOctober 2, 2018Places\n\n\nWHAT IS KANZURI?\nKanzuri is a special seasoning paste made from fermented red peppers. The peppers are grown locally, and the product is  produced locally in Myoko City. Kanzuri is now being sold all over the world and is becoming quite famous.\nHOW IS IT MADE?\nThe peppers are first preserved with sea salt and then during the winter months they are laid out on the fresh snow which draws out the salt, bitterness and some heat from the peppers while also increasing its sweetness. If you are in Myoko during the winter season you can see this amazing sight. After being laid out on the snow the peppers are then crushed and mixed with a rice koji (like yeast to aid fermenting), some yuzu (Japanese citrus fruit) and salt. This mixture is then left to ferment for 3 years. Recently they have a new product that is left to ferment for 6 years!\nHOW IS IT USED?\nThe Kanzuri spice is traditionally used in many foods such as ramen and soups. It can be used in any dish that requires a bit of heat and that famous Japanese umami taste.\nAvailable Tours\nThere are three types of tour that are available at the factory.\nFor paid guided tours please visit our green season tours page.\n\n\n\n\n\nAll year factory tour.\nThis is a basic spoken tour where you can have a brief look down in to the factory and can hear a talk (in Japanese) about the history of the facory. You will also get the chance to try the various products and also buy them in the shop. This tour is free and lasts about 45min. You will need to book the tour so please ask your hotel to help you with this.\nSummer/Autumn pepper picking\nYou can help pick the peppers and prepare them to be used for the next batch of kanzuri. This tour has a small cost and must be booked in advance. Please contact us for more info and to book this experience.\nWinter peppers\nDuring the winter the peppers are laid out on the fresh snow. You can view this to take photos or take part in the laying out the peppers. To visit and photograph the area is free of charge. If you wish to help with putting the peppers on the snow you should contact the factory either through us or your hotel to arrange a time and date. You can try this from mid-January to the end of February.\n\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/spring-snowshoeing-in-sasagamine/","title":"Spring Snowshoeing in Sasagamine","description":"Experience snow during the spring months at Sasagamine which has snow until mid-May. Snowshoe through the beautiful forest to the two pond areas.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSpring Snowshoeing in Sasagamine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSpring Snowshoeing in SasagamineUpdated onMay 2, 2019Places\nSnowshoe adventures\nIf you are looking to experience snow during the spring months, then Sasagamine which has snow until mid-May is a great place to head to. The road leading up to Sasagamine plateau is usually clear by the beginning of April. The only way to reach the area at this time is by car as the bus service doesn’t start until the beginning of July.\nSnowshoeing through the forest at Sasagamine.\nThe snow is hard so you can walk with just boots. Snowshoes which are available to rent from the visitor centre at Imori Pond can be great if you are worried about slipping.\nYou can walk through the woodland and field areas and head to either of the two ponds, Sennin Pond and Shimizuga Pond. There are no markings and visible trails so you will need either a map or guide if you wish to head to a specific area. Please also be careful to not lose your bearings as with no trails and signs yet visible it can be easy to get lost.\n\nThere are many animal tracks in the forest.\nPlants just starting to come back to life.\nSennin Pond in spring. Still covered with snow.\nBeautiful winter scenery in spring.\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/activites-around-myoko/","title":"Activites around Myoko","description":"Here a few suggestions for those in Myoko during this early season which has found us lacking in snow. This is great chance to experience some great culture and local sights.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nActivites around Myoko\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenActivites around MyokoIdeas for visitors to explore during the winter season. There are some great culture and local experiences. When you need a break from the slopes try some of these places.\nUpdated onDecember 22, 2019Places\nHere a few suggestions for those visitors in Myoko during the winter early season. This is great chance to experience some great culture and local sights. If there isn’t enough of the famous powder early season, don’t be disappointed, get out and see some of the great Myoko sights.\nMyoko Area\nBefore the snow buries Myoko now is a great time to see places such as Imori pond & Naena waterfall while they are still accessible and visible. You may need a car to reach these areas.\n\n\nArai\nThere are a couple of great places that you can visit in Arai, both while free will require a call just to let them know you are coming. You can visit both places below in one day as they are close to each other. Also you should swing by for lunch as the great sushi restaurants near the train station. Try Yamato Sushi and Sushi Yoshi.\nKimi no I is a local famous sake brewery and offers a tour of its historical brewery. The tour is Japanese although English leaflets are provided. If you have a translator, you will obviously gain more from the tour. You will be shown the brewery and the process used to create this award-winning sake. At the end you will also be given the chance to sample different types of sake.\nKanzuri is a famous local spice produced in Myoko City and sold worldwide. The peppers used in the spice are laid upon the fresh snow each year. This draws out the bitterness and enhances the flavour and sweetness. You can have a brief tour in which you are told about the process of making kanzuri and also get the chance to try the different kinds of spices. You can then visit their shop to purchase any of their products. Makes for a great present.\n\n\nTrying different spices\n\n\nJoetsu\nThere are many places to explore in the Joetsu area. Here are a few suggestions.\n\nUmigatari Aquarium: A great day out for everyone, especially for families. This newly constructed aquarium has a stunning design and features beluga whales and great numbers of magellanic penguins.\n\nHoncho: This is the main street that has many interesting shops and restaurants to explore. If you keep your eye out for the tea shop you can try your hand at making traditional green tea in the shop. This experience is free of charge. The art gallery further up the street also offers a calligraphy experience where you can try writing a Japanese kanji character.\n\nRyotei Ukiyo: A ryotei is a traditional form of high-class Japanese restaurant that represents the region’s food culture. Few ryotei now survive outside Kyoto and Tokyo, making them highly precious. The ryotei in Joetsu is listed as a Japanese national treasure! This beautiful old building is great to explore if they are able to, they will show you around. This is a great place for lunch and also dinner. Usually lunch doesn’t require booking, but dinner does.\n\nNagano\nThere are many places you could venture to in Nagano but the place you must visit is the world heritage site Zenkoji Temple. This important temple contains over 1,000 years of history and is great fun to explore. Make sure you pay the small entrance fees and climb the gate, and also enter the main temple area. After visiting the temple also stop by a local restaurant just outside the temple to eat their amazing noodles!\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/popular-autumn-spots/","title":"Popular Autumn Spots","description":"Here are some of the most popular spots to visit in Autumn in Myoko.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nPopular Autumn Spots\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenPopular Autumn SpotsUpdated onSeptember 4, 2019Places\nAutumn in myoko\nAutumn is a stunning season in Myoko. There are many great places to see the spectacular leaves. Here are some of the most popular places around Myoko to experience this amazing season. For buses in Myoko during this season check our timetables here.\nKoya Pond (Mt Hiuchi)\nThis where autumn begins in Myoko. The leaves start changing at the top of the mountain and then gradually come down to the bottom. Koya pond is located near the peak of Mt Hiuchi so you will have to hike up the mountain to see it. The climb is worth the effort as this area is breathtaking in autumn and is a sight you will never forget.\nSasagamine\nSasagamine is the second area that autumn hits in Myoko. Located high up the mountain about a 30min drive or bus ride from Myoko village area this area starts to change colour around the first week of October. There are many trails to walk around Sasagamine which makes it a great place to relax and fully experience autumn in Myoko.\nNaena Falls\n\nOne of the most popular tourist spots in Myoko, Naena waterfall is spectacular all year round. In fall the waterfall is framed by gorgeous yellow and oranges making this an amazing place for photography. This easily accessible spot is a must see.\nImori Pond\n\nBeing at the base of Mt Myoko Imori pond in Ikenotaira experiences a change in colours around mid/late October. Imori pond is one of the most famous photo spots in Myoko and the beautiful colours make it even more stunning. Its a great place to take a walk on a cool autumn day. You can then try the all you can eat tempura buffet while taking in this spectacular view.\nSuginohara gondola/Sky cable gondola\n\nThere are three gondolas to ride in autumn. Suginohara ski resort gondola, Akakura Kanko sky cable and Lotte Arai resort gondola. They take people up the mountain to see the leaves and also get a great view of the village and surrounding scenery below. Suginohara & Kanko areas have trails you can walk and on a clear autumn day all of these areas are great to experience the  leaves in Myoko. We recommend riding all three gondolas!\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/setsugekka-resort-train/","title":"SETSUGEKKA RESORT TRAIN - Myoko Tourism","description":"The Setsugekka is a luxurious resort train with large panoramic windows that travels from the mountainous area of Myoko to Itoigawa on the coast of Japan.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSETSUGEKKA RESORT TRAIN - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSETSUGEKKA RESORT TRAINUpdated onApril 26, 2021Places\nWhat is the Setsugekka train?\nThe Setsugekka ( 雪月花 “snow,” “moon” and “flower”) is a bright crimson luxurious resort train with the largest panoramic windows in Japan that travels from the mountainous area of Myoko to Itoigawa on the coast of Japan. The large windows provide uninterrupted views of gorgeous scenery as you travel through the rice fields, local countryside and along the coast of the Sea of Japan. \nThis luxurious travel experience comes complete with multicourse dining with French and Japanese menus specially developed by local chefs. Travel on the Setsugekka resort train requires advanced reservation.\nThe train departs Myoko at 11:30 and arrives in Itoigawa at 13:36\nThe cost is ¥17,500 per person.\n\n\nMyoko mountain range\n\n\nThe Sea of Japan\n\n\nAbout the train\nCar One: The Setsugekka train is made up of two cars. In car one all seats face the large windows where you will get the best views of the Myoko mountain range and the Sea of Japan. These special windows are the largest found in any train in Japan. They are heat shielded to prevent the interior of the train from getting hot and they cut UV rays by 90%. \n\n\nInside car one.\nCar Two: Car two also features large panoramic windows which provide spectacular views on both sides of the car. At the end of the car is a special high deck with a table for four, at the other end is the Sakura lounge where you can order a variety of drinks including specially selected wines and sake.\n\n\nInside car two.\nFood\nOn your journey aboard the Setsugekka you will also be able to enjoy the best local seasonal ingredients in a delicious, handcrafted menu created by famous local chefs such as Ryuta Iizuka, a two-Michelin-star chef or Tsurugiya from an Itoigawa restaurant open for nearly 200 years.\nThe meal is served in a three-tier box, with each tier being a different course. You are also served a sweet condensed corn soup and a desert alongside the boxed meal. \n\nCourse 1\nCourse 2\nCourse 3\n\nBooking\nAll seats on the Setsgekka are reserved. You can book directly through the offical website here. \nPlease note that the trip is one way, for example from Myoko to Itoigawa. After you trip ends your ticket allows you to ride any other train on the line for free. So you can ride a normal train back to your original departure point if needed. There is no smoking and pets allowed on the train. While there is no dress code you should not dress overly casual. \nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/sasagamine-skunk-cabbages/","title":"Sasagamine Skunk Cabbages","description":"Sasagamine Skunk Cabbages bloom each year in spring. Sasagamine in Myoko Kogen is one of the best places to se these beautiful plants.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSasagamine Skunk Cabbages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSasagamine Skunk CabbagesUpdated onJune 15, 2018Places\nSkunk Cabbages in Sasagamine Woodland\nSasagamine in Myoko Kogen is a stunningly beautiful area of natural beauty. Located at 1300m above sea level deep in the Myoko mountain range it is far from any village and is an excellent place to escape to. During spring the Sasagamine skunk cabbages bloom in areas deep in the forest. The area is easily accessible by foot. A loop around the area will take you about 1.5 – 2hrs depending on your pace. Good footwear is advisable as you are walking through a forest area and in this season, there is still a little snow you must walk over and there are plenty of muddy areas.\nThe hiking trail is lined with skunk cabbages all the way around. There are also plenty of other wild flowers that are now blooming. The highlight of the walk is an area called Yumemidaira which is a large open area filled with skunk cabbages with a beautiful mountain back drop. As well as the new flowers, there is also plenty of wild life, especially frogs which can be found near the watery areas. If you wish to see the skunk cabbages, they are now in full bloom and will probably be good until the end of next week. There are many different hiking trails to explore in Sasagamine. The area changes with the seasons. It is a stunning area to visit all year round.\nYume mi  daira\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/mt-myoko/","title":"Mt Myoko","description":"Mt Myoko is the dormant volcano that looms over the village giving the area its name. It can be seen from every point with in Myoko City. The mountain is one of Japans 100 famous mountains.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMt Myoko\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMt MyokoUpdated onAugust 9, 2018PlacesMt Myoko\n\t\t\t2,454 meters/8,051 feet\t\t\nMt Myoko is the dormant volcano that looms over the village giving the area its name. It can be seen from every point with in Myoko City. The mountain is one of Japans 100 famous mountains.\nAround 20,000 years ago the top of the mountain was blown off in a major eruption leaving a 3km wide caldera hollow at the top of the mountain. About 6,000 years ago the central crater developed which now gives Mt Myoko its distinctive shape. All the major ski runs in Myoko are found on the slopes of Mt Myoko. The onsen hotsprings also all find their sources within Mt Myoko.\n \n\t\t\t\t\t\tTrail Map\n\nMt Myoko Trail\nThere are 3 starting points to choose from, Tsubame Onsen, Kanko Resort and Sasagamine. If you choose to start from Sasagamine you will need to keep an eye for the sign for Mt Myoko (妙高山). If you miss it you will end up climbing Mt Hiuchi instead.\nThe usual starting point for most people will be Tsubame Onsen. We recommend allowing 4-6 hours to reach the summit depending on pace. Mt Myoko is a steep climb from start to finish so its recommended you keep a slow steady pace. If climbing during the summer months you should also have 4L of drink with you.\nWhen climbing from Tsubame onsen after passing the hotels you will take the path on the left and follow the paved road upwards. You will then reach a narrow path that heads in the forest. There is a sign for Mt Myoko (妙高山) but it might be hard to see.\n\nTake the narrow path to the right.\nOn this path you will pass a couple of large waterfalls on the right-hand side and also a natural drinking water outlet. The path is narrow in places with a sudden drop, so care is needed. You will then reach a small river that you will need to step across.\n  \nContinuing upwards you will reach Tengudaira which is marked by the small shire. This is great place to take a break before you continue upwards. The path to left will take you down to Kanko Resort ski field which is an alternate start/finish point.\nAs you start to near the peak you will need to climb some steep cliff areas by chain. These areas are not difficult to climb with use of the chain and are just steep, not vertical. After scaling the chain areas, you should be on the peak with in an hour.\n  \nUse the chains and rope to assist your climb.\n  \nClimb with care.\nThe views from the top are spectacular. On a great day you can see across the country to Mt Fuji. Mt Myoko often is covered in cloud after midday, so you should aim to reach the summit before then. Sometimes you are treated to an amazing sea of low lying clouds that are below you as you sit on the summit. At the peak of Mt Myoko, you can walk 400meters to its secondary peak. This area is more open making it a great place to have lunch.\nIf you are of average pace you should plan to allow 5 or more hours to reach the summit. You should ideally start as early as possible to allow enough daylight for the climb and decent. Mt Myoko is a tough climb as it has no flat or easy terrain like Mt Hiuchi. It is a continual steep climb. You can check out the climb trail on our trails page here.\n \nYou can see Mt Hiuchi and the Northern Alps!\n  \nThe peak of Mt Myoko\n  \nSpectacular sea of clouds\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/illumination/","title":"Apa Resort Illumination (Apallusion)","description":"The outdoor Apallusion illumination display is one of the largest of its kind in the world. It is truly stunning to see the whole landscape lit up with millions of lights.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nApa Resort Illumination (Apallusion)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenApallusion 2023Updated onJune 22, 2019Places\nAPA 10th Anniversary Illumination\nJuly 1st to November 15th\nOpen: Fountain illumination area 17:00-21:00Closed: Every Tuesday\nAdmission fee: 16+ 1,000 yen / U16 500 yen / Free for preschoolers\nThe illumination at APA Resort Joetsu Myoko will celebrate its 10th anniversary this year! You can enjoy fantastic scenery that includes illuminations, fountain productions that match hit songs, illumination trees, and chapel illumination mapping.\nThe Apa Resort Apallusion is an impressive outdoor illumination display. The display changes each year so there is always something new for a returning visitor to see. This year there are several new features to the display. First there is an indoor play area for young children situated in the hall opposite the car park. The main light display is centered around the chapel and lake. The paved flat path loops around the area making for a very pleasant walk. The area is flat which makes it very accessible for families, push chairs and wheel chairs etc. \nThe light display features animals and several LED light boards that make great photo spots. This year Apa Resort have added an illuminated water screen on the lake. A light show is projected on to the water. There is also a firework display on set days. Its a beautiful area to walk around and you should expect to spend maybe 30-40min at the show. \nFirework Dates [Scheduled at 20:00]July: 1st (Sat), 15th (Sat), 16th (Sun)August: 11th (Fri), 12th (Sat), 13th (Sun), 27th (Sun)September: 16th (Sat), 17th (Sun)October: 7th (Sat), 14th (Sat)November: 3rd (Friday holiday)\nDue to various circumstances such as weather conditions such as strong winds, the event may be canceled or postponed, the launch time may be changed, or the date may be changed suddenly.*The display is around 2 minutes. (August 27th (Sunday) is about 4 minutes of large fireworks)\n\n\n\n\n\n\n\n\n\nAccess\nThis year there is no bus to the resort. This means the only to get there is either by car or taxi. You can ask your hotel to contact Kogen Taxi to arrange transport to Apa Resort.\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/imori-pond/","title":"Imori Pond","description":"Imori pond is one of the most scenic and photographed spots in Myoko Kogen. It is easy to get to and changes with the seasons.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nImori Pond\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenImori PondUpdated onJuly 22, 2018Places\nImori Pond – beautiful all year round\nImori pond is one of the most scenic spots in Myoko Kogen. It is famous for the mirror-like water that perfectly reflects Mt Myoko. It is an amazing photo spot. Imori pond is situated in the Ikenotaira area of Myoko Kogen. It is very easy to reach by car and bus and is accessible all year round. The pond has a trail running around it that allows you to walk all along the edge of the water. It takes about 15 minutes to walk around and the path is flat and wide so suitable for everybody.\nImori pond changes with the seasons. In spring the blooming skunk cabbages know as mizubasho in Japanese start to flower and look amazing. The skunk cabbages usually start to appear around mid April, depending on the temperatures and weather. Many people come to Imori Pond to see this site. Spring is also one of the best seasons to capture the reflection of Mt Myoko in the still water of the pond.\nSkunk cabbages in bloom at the end of April.\nDuring summer the Imori Pond is surrounded by lush greenery and the backdrop of Mt Myoko is covered with green trees now all the snow has disappeared. As pond plants start to grow in the water it can become more difficult to capture that perfect reflection of Mt Myoko in the water.\nImori Pond early summer\nAutumn, of course, brings a lot of colour to the pond area as trees on the mountain and around the pond change their colour to hues of red, yellow and orange. During winter the snowfall covers the lake and paths but the visitor centre next to the pond is still open and you see the pond from the edges of the road and even climb on top of the snow in some areas.\nStunning in autumn\nFood\nYou can eat and get ice cream at the restaurant on the side of the lake called Bashouen (芭蕉苑). The restaurant is open from spring to the end of autumn. You can try some noodle dishes and other light food. They also sell soft cream, so during the summer months you can grab a nice ice cream to eat on your walk around the pond. Their all you can eat udon noodles and tempura set is highly recommended. You can try some deep fried wild mountain vegetables.\nBashouenWild vegetable tempura\n\n\n\nGetting there\nYou can drive directly to Imori pond. You can park at the visitor centre or next to the pond. There are also plenty of buses that run from Myoko Kogen station to the pond. Check here for the local bus timetables\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/sasagamine/","title":"Sasagamine","description":"Sasagamine is a beautiful woodland/forest area filled with nature deep in the Myoko mountain range. An outstanding area of natural beauty.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSasagamine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSasagamineUpdated onJuly 23, 2018Places\nLocated deep in the Myoko mountain range and part of Myoko Togakushi Renzan National Park. The Sasagamine plateau is located 1,300m above sea level, receives little rainfall and is cool even during the summer months. The area covers over 132 hectares so there is a lot to explore. The grassland is dotted with huge Japanese elm trees and the Myoko mountain range frames the background. There are many walking and hiking routes to explore and the area is also the starting point for climbing Mt Hiuchi. Below we have listed some of the popular spots in Sasagamine.\nFor bus timetables please check our local bus page.\nFor Sasagamine hiking trails check our trail page here.\nPOPULAR AREAS IN SASAGAMINE\n\n\nSENNIN POND\nSennin Pond is a beautiful little spot that you pass on your way to Sasagamine on the road. If you have your own car you can stop in the small parking area or alternatively you can walk from the main  area to the pond. The pond itself is small but beautiful. In the right weather it beautifully reflects the mountains in its still waters.\n\n\nSASAGAMINE FARM AREA\nSasagamine farm is a large area of expansive greenery with large Japanese elm trees dotted across it. From July, the cows are put out to graze in this area and the fields are covered with bright yellow buttercups and other flowers. There are numerous paths around the farm area and surrounding woodland areas which are great for walking. All are well sign posted.\n\n\nSHIMIZUGA POND\nShimizuga Pond can be reached from the farm area. Most of the trails will lead that way and the pond is sign posted. This is a very picturesque spot and is a nice area to stop and have a picnic. This area is beautiful in both spring and autumn.\n\n\nSASAGAMINE DAM & OTOMI LAKE\nTo cross over to the forest area (see below), you must first cross this amazing dam. In the heart of Sasagamine this dam holds back the waters of Otomi lake. It is amazing to walk across and provides some great views of the lake and surrounding area and mountain ranges.\n\n\nFOREST AREA & WETLAND AREA\nThis is one of the best areas to take a walk in Sasagamine. It becomes accessible from mid-May after the snow has melted. To get to this area you must cross over the dam and ascend a steep stairway. From the top, the paths are then reasonably level with no steep inclines. It’s a great place for the whole family to take a walk. The woodland and wetland areas are filed with amazing flowers and plenty of wild life. It is a truly stunning area. The small loop will take 2-3 hours to walk around depending on your pace and how often you stop to take photos. In spring, the area is filled with skunk cabbages. At the half way point you will come across a large wetland area called Yume Mi Daira. This open area is filled with skunk cabbages and Mt Mitahara fills the background. This is one of the most famous photo spots in Sasagamine.\nFor a trail map check our page here.\n\nSEASONS IN SASAGAMINE\nSasagamine is a great place to experience the different seasons. The area is drastically different depending on when you visit. In spring the area is fields of yellow, summer it is lush green and then in autumn the trees turn shades of yellow orange and red.\nspring fieldssummer monthsautumn leaves\nPLACES TO EAT\nGreen House Restaurant\nGreen house is a great place to eat. They are famous for the jumbo steak they serve. we recommend their teishoku set (set meal). You will get a variety of small dishes which includes steak, mountain vegetables, soup, rice and more. Its very delicious.\nGreen House famous jumbo steak – 5,500 YenSasagamine set meal – 2,500 YenHamburg set meal – 1,300 YenPork Cutlet set meal – 1,300 YenRamen – From 800 YenVariety of soba and udon dishes – From 800 Yen\n\n\n\n\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/mt-hiuchi-in-summer/","title":"Mt Hiuchi in summer","description":"Climbing Mt Hiuchi during the summer offers you the chance to see the flowers, insects and lush greenery of the mountain.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMt Hiuchi in summer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMt Hiuchi in SummerUpdated onAugust 1, 2018Places\nClimbing Mt Hiuchi\n\nMountain climbing is usually best in the autumn months as the weather is cooler. However, climbing during the summer offers you the chance to see the flowers, insects and lush greenery of the mountain.\n\n\nIf you plan to climb either Mt Hiuchi or Mt Myoko during the summer we highly recommend you take at least 4L of liquid with you. For example, 2-3L of water and then some sports drinks.\nIn the Japanese drug stores, you can buy salt/mineral sweets which can be a life saver due the amount you will sweat when climbing. If you don’t properly prepare, the loss of salt through sweating can lead to severe cramps in your legs whilst climbing. \nMt Hiuchi is mostly covered by trees, so you will be climbing in the shade for the most part. Its surprising how much tougher the heat makes what is usually a relatively easy climb. I would highly recommended going at a slow steady pace. This means you should get an early start to your climb as the trail to the top can take between 4-6 hours depending on pace.\nIf you plan to stay over night then you book the hut from our page here.\nThe beauty of Mt Hiuchi really starts to shine in the last quarter of the climb. When you hit the Koya pond area where the hut is also located the area is just breath taking. The pond area is lush green and the flower gardens that you pass through on the way to the summit are blooming with purple, yellow and white flowers.\nKoya Pond\nThe final climb to the summit is the toughest part. The final steps to the top, in the exposed heat of summer is very hard. I have had my legs cramp here in summer, so make sure your are hydrating and taking it easy. Remember that is you drink when you are feeling thirsty, then you are already dehydrated.\nWhen you get to the summit you are in for a breath-taking view. You can see the peak of Mt Myoko in front of you with the Northern Alps to the right and the Sea of Japan behind you. All the effort in climbing in the sun is well worth the reward of the view from the top.\nFor bus times to Sasagamine which is where you start the climb check the local bus page. The Sasagamine bus is at the bottom of the page.\n\nFlowers blooming in summer\nKoya Pond\nFlower garden\nKoya Pond\nMt Hiuchi\nMt Myoko seen from Mt Hiuchi\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/sekiyama-fire-festival/","title":"Sekiyama Fire Festival","description":"The famous Sekiyama Fire Festival is held each year in July. Experience traditional Japanese culture that dates backs hundreds of years.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSekiyama Fire Festival\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSekiyama Fire FestivalUpdated onJuly 2, 2018Places\nAbout the Sekiyama Fire Festival\nJuly 15th and 16th 2023\nThe Sekiyama fire festival is a traditional festival held each year in mid July. It is a 2 day festival held over a weekend.\nThe first day of the Sekiyama Fire Festival is without doubt the most exciting to see. The festival dates back hundreds of years and it’s a great opportunity to experience some great Japanese culture. The first part of the festival is a performance honouring traditional samurai training. Over 1000 years ago the shrine was used as a training area by local samurai.\nAfter the performance two groups set fire to two large log piles that have been prepared. These are then pulled by everyone in attendance along the path in front of the shrine. The logs aren’t on fire during the pulling part of this event. Everyone is encouraged to help pull the huge log piles. The pulling is done in stages with the breaks in-between being filled by loud singing and sake drinking!\n\n\n\n\n\n\nIn the afternoon there is a grand sumo competition. Local residents compete in the event which is held within a traditional sand arena. Contestants are cheered on by friends and family as they do battle to see who will be champion. While the adult event is no holds barred there is also a more gentle event for small children. Children similarly compete to find the champion. \nFor buses to Sekiyama Shrine check our page here.\nFor trains to Sekiyama Station check our page here.\n\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/tsubame-onsen/","title":"Tsubame Onsen","description":"Tsubame onsen is one of the most stunning hot springs in Myoko. Outside in the forest with natural hot mineral water from the mountains.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nTsubame Onsen\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenTsubame OnsenUpdated onJuly 20, 2018Places\nAbout Tsubame Onsen\nTsubame Onsen in fall.\nSet on a spectacular cliff-side next to a fast-flowing river Tsubame Onsen is a great destination for those wishing to experience something off the beaten track. The hot spring boasts white mineral rich waters which are supposed to have great healing properties especially for rheumatism, neuralgia, and various skin ailments. The atmosphere here is beautiful. The secluded onsens and the peace that comes with being in the middle of nowhere with nothing around you is so relaxing.\nThe onsen are reachable from around June and stay open until the heavy snow starts to fall around December time.\nOugon no Yu\nOugon no Yu, which has 2 onsen pools separated by a rock wall can be reached by walking up the steps found immediately on the left at the top of the village area after you pass the last building. Take the paved path straight up the hill until you reach the onsen on the right. There is a small changing room for each onsen and they are separated by gender. The male bath is on your left as you look at them and the female bath to the right. \nThis onsen is free of charge to enter.\nThe onsen is cleaned each Monday & Friday morning and the baths are emptied at this time.\nOugon no Yu actually opens early in March and you can enter whilst there is still snow surrounding the baths. For more info on the spring opening of Ougon no Yu please check out our special page here.\n\nOugon no Yu\nOugon no Yu\n\nKawara no Yu\nKawara no Yu, is a mixed gender outdoor bath. To reach this bath you should continue straight after passing the hotels and head through the forest for about ten minutes. You will then cross a small suspension bridge. Immediately after crossing turn left and dip down under the bridge. Continue along the narrow path until you reach the onsen. You will need to take your own towels. There is a small changing hut available next to the bath.\n\nKawara no Yu\nKawara no Yu\n\nYou can reach Tsubame Onsen by bus. \n\n\n\n\nBus Stop\n\n\n\n\nSekiyama Station\n*6:14\n07:43\n09:03\n10:40\n13:34\n15:30\n17:22\n\n\nSekiyama Shrine\n*6:17\n07:46\n09:06\n10:46\n13:37\n15:36\n17:25\n\n\nMarket “TOMATO”\n–\n–\n–\n–\n13:42\n–\n–\n\n\nDaidohara Flower\n–\n07:57\n09:17\n10:57\n13:48\n15:47\n17:36\n\n\nSeki Onsen\n*6:29\n08:09\n09:29\n11:09\n14:00\n15:59\n17:48\n\n\nTsubame Onsen\n*6:34\n08:14\n09:34\n11:14\n14:05\n16:04\n17:53\n\n\n\n\n\n\n\n\nBus Stop\n\n\n\n\nTsubame Onsen\n*6:37\n08:15\n09:40\n11:35\n14:30\n16:20\n18:01\n\n\nSeki Onsen\n*6:42\n08:20\n09:45\n11:40\n14:35\n16:25\n18:06\n\n\nDaidohara Flower\n*6:54\n08:32\n09:57\n11:52\n14:47\n16:37\n18:18\n\n\nMarket “TOMATO”\n–\n–\n–\n11:54\n–\n–\n–\n\n\nSekiyama Shrine\n*7:05\n08:43\n10:08\n12:03\n14:58\n16:48\n18:29\n\n\nSekiyama Station\n*7:08\n08:46\n10:14\n12:06\n15:04\n16:51\n18:32\n\n\n\n\n* No bus service on Saturdays, Sundays and School Holidays\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ougon-no-yu/","title":"Ougon no Yu (outdoor snow hot spring)","description":"Ougon no Yu the outdoor baths at Tsubame Onsen open usually during March. Try the baths while they are still surrounded by meters of deep snow. A perfect trip for those who like to head off the beaten path.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nOugon no Yu (outdoor snow hot spring)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenOugon no Yu (outdoor snow hot spring)Updated onJuly 14, 2018Places\nOugon no Yu – hot spring surrounded by deep snow\nThe outdoor baths (Ougon no Yu) open at the end winter in March – beginning of April time. It is an amazing experience to try this hot spring while it is still surrounded by meters of deep snow. To reach this amazing bath you will need to walk over the snow for about 400m. Whilst the snow is still very deep it is compact enough to allow walking on it. Even so, you will need to watch your step and have some boots with you. The bath is very easy to find, just turn left after passing all the buildings. Then just climb up the snow and head up the hill. You will be walking on snow above the baths so be careful not to walk straight past them!\nOutdoor bath Ougon no Yuu\nThis is an excellent area to head to for those who are looking to explore a little. The baths are not usually busy at the end of the winter season so this is an excellent time to head there. You can also try the amazing onsen at Hotel Iwatoya and Hotel Hanabun.\n\n\nRyokan Hanabun\n\n\nHotel Iwatoya\n\n\nThere is a local bus that runs from Sekiyama station to Tsubame Onsen. Check our page HERE.\nFor train times from Myoko to Sekiyama check our page HERE.\nFor those with a car, get on R18 heading to Arai/Joetsu and turn left at the Tomato farmers market and continue up the road past Seki Onsen until you reach Tsubame Onsen at the end of the road.\nOutdoor bath Ougon no Yu\nTurn left at the top of the road and walk up the snow.\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/zenkoji-temple/","title":"Zenkoji Temple - Myoko Tourism","description":"Zenkoji Temple is one of the most important temples in Japan and contains 1,400 years of history with in its compound.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nZenkoji Temple - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenZenkoji TempleUpdated onJune 3, 2018Places\nAbout Zenkoji Temple\nZenkoji Temple is one of the most important temples in Japan and contains 1,400 years of history with in its compound. The area is considered a national treasure and is an important place of history, culture and architecture. Founded in the 7thcentury the temple contains the first ever Buddhist statue to be brought to Japan when the religion was first introduced to the country. The statue of Amitabha was buried in a moat by an anti-Buddhism group in the 6thcentury and later recovered and enshrined in Zenkoji Temple. Today a replica statue is on display to the public and the real one is shown every 6 years. The next display will be held in 2021.\n\nThe Zenkoji temple area is large and there are two impressive large gates that lead up to the main temple area. The temple grounds include the main temple and several other smaller buildings and a museum. The main temple is incredibly impressive. Several things you should take care to notice includes the purification smoke outside the temple. Upon entering the temple, it is customary to offer a small money offering to the gods and Buddha. Money is thrown in the collection box and a prayer is made.\n\n\nIn the entrance area is the Obinzuru statue. Obinzuru was one of the disciples of Buddha. If you rub the area of his body that corresponds to an area that troubles you it is said that you will be cured. The statue is now worn smooth from having been rubbed by many thousands of temple visitors.\n\nThe beautiful main temple.\nFor 500yen you can enter further in the main area of Zenkoji temple and can take a closer look at the main altar. A particularly interesting area is the pitch-black corridor that runs under the temple. It is said that if you can touch the key which is attached to the wall you will be granted access to paradise. \nTo learn more visit the Nagano City website here.\nAccess\nTake the train to Nagano train station, From the station you can take a bus directly to the temple area or you can walk there. The walk takes about 25min from the station, but you will pass all the interesting shops that line the road leading the temple as well as the two large temple gates. For those with a car there are car parks directly behind the temple. They are paid car parks but are not expensive.\nFood\nThere are many restaurants just outside the temple. The traditional soba noodle dishes are highly recommended.\nTraditional soba noodles.\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/kimi-no-i/","title":"Kimi no I","description":"Kimi no I is a great place to visit for lovers of Japanese sake and for those who enjoy traditional Japanese culture. The brewery was founded in 1842.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nKimi no I\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenKimi no IUpdated onFebruary 25, 2019Places\nKimi no I, a famous local brewery \n\nKimi no I is a great place to visit for lovers of Japanese sake and for those who enjoy traditional Japanese culture.\nKimi no I sake brewery has over many years been the recipient of multiple gold awards at various national sake competitions. The brewery was founded in 1842 and sake has been brewed in this current building since 1904! The brewery is located in the Arai area of Myoko on the Hokkoku Kaido Highway – a historically very important road where rice, salt, seafood, and Sado gold were transported in the Edo Period. The heavy snowfall in the area creates natural refrigerating conditions, while the ancient, sacred Mt. Myoko provides clean underground water – making Arai an ideal location for brewing sake. \nYou can visit our guided tours page to find a guided tour of Kimi no I.\nA general brewery tour is free of charge but please note that the tour is usually conducted in Japanese. To arrange a tour please ask your lodge to help you contact them using the phone number listed below. Tours can be arranged for any time, but some days may not be possible depending on the schedule of the brewery. At the end of the tour, you will be able to sample a variety of their different sake.\n\nKimi no I is located in the Arai area of Myoko City. It is the heavy snowfall and cold environment that helps in the production of high-quality sake. The cold, clean air and water all help to grow high-quality rice that is the real source of the saké.\nBy visiting the brewery, you can get a special insight into the process of making this award-winning sake. Kimi no I uses a traditional and labour-intensive method of making their sake called yamahai ijikomi. This method has been handed down over generations and is what gives the saké brewed this way its rich and delicious flavour.\n\n\n\n\n\nContact DetailsPlease ask you lodge to call to arrange the tour date and time.Phone (Japanese): 0255-72-3136\nThe brewery is a 10-minute walk from Arai train station.\nYou can find train timetables here.\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/matsugamine-cherry-blossoms/","title":"Matsugamine Cherry Blossoms","description":"Check out the amazing cherry blossoms at Matsugamine. One of the best cherry blossom photo spots!","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMatsugamine Cherry Blossoms\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMatsugamine Cherry BlossomsUpdated onJune 14, 2018Places\nPhotograph Matsugamine Cherry Blossoms\nThe cherry blossoms at Matsugamine provide an amazing photo opportunity. The trees line the road leading up to and past the country club. The place everybody likes to stop however is on the bridge that crosses over the pond and looks into the golf club. On a clear day, Mt Myoko makes up the background and the trees and bright red bridge reflect in the clear water. It’s an amazingly scenic photo spot. This is an area for taking a few photos and then moving on. There isn’t really anywhere to park your car and take a walk. \nCheck out our photos for some of the amazing photos you can snap at this spot.\nStunning blossoms at Matsugamine Country Club.\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/jigokudani-monkey-park/","title":"Jigokudani Monkey Park","description":"The world famous Jigokudani Monkey Park is situated in Yamanouchi Town in Nagano Prefecture and is a must-see location during the winter months.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nJigokudani Monkey Park\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenJigokudani Monkey ParkUpdated onJuly 10, 2018Places\nVisit the famous Jigokudani Monkey Park\nThe world famous Jigokudani Monkey Park is situated in Yamanouchi Town in Nagano Prefecture and is a must-see location during the winter months. It is easy to get to from Myoko and you have many different options available to you should you decide to visit the park. The snow monkeys are a hugely popular tourist attraction during the winter and images of the monkeys sitting in the hot spring have been seen all over the world.\nThe Jigokudani Monkey Park is actually open all year round. However the monkeys usually only enter the hot springs during the coldest days of the year.\nThe Jigokudani Monkey Park is part of the Joshinetsu-Kogen National Park and is a beautiful area to visit. The name Jigokudani meaning “hell valley” comes from the steaming geysers that shoot hot water and steam into the air. Upon arrival to the park area you will walk through the forest to the park which takes about 20-30min. All the monkeys are wild and free roaming.\nWhile they are used to people you should still be aware that these are wild animals and you should take care at all times, especially with your camera/phones/bags and food. Also make sure you are wearing suitable clothing/footwear suitable for woodland terrain.\n\n\n\nPARK INFO\nOpen throughout the yearHours: Summer (Apr – Oct) 8:30am – 5:00pmWinter (Nov – Mar) 9:00am – 4:00pm\nAdmission Fee: Adult 800yen Child: 400yenFor more information: Visit offical website HERE\n\n\n\nBUS\nThere is a daily shuttle that departs Akakura Onsen. This shuttle requires no reservation and payment is made in cash on the bus. Credit cards can not be used.\nShuttle operates from January 10th to March 12th.\nAdult 5,000 JPY  Child 4,000 JPY (return trip price)\n\n\n\nTime\nStop\n\n\n\n\n10:00\nAkakura Onsen\n\n\n10:02\nAkakura Kanko Resort\n\n\n10:04\nHotel Windsor\n\n\n10:15\nMyoko Bus Terminal\n\n\n11:30\nMonkey Park\n\n\n\n\n\n\nTime\nStop\n\n\n\n\n14:20\nMonkey Park\n\n\n15:35\nMyoko Bus Terminal\n\n\n15:46\nHotel Windsor\n\n\n15:48\nAkakura Kanko Resort\n\n\n15:50\nAkakura Onsen\n\n\n\n\nTRAIN & BUS\nAlternatively if the time above doesn’t line up with your schedule you can use take the train from Myoko to Nagano and then use the bus from Nagano station to the park\nFrom Myoko to Nagano take the train (Shinano Railway Kita-shinano Line).From Nagano to the monkey park, go to the east exit bus stop in Nagano station and take the Nagaden Express Bus Shigakogen Line.\n08:39 train from Myoko only operates on a weekday.\n\n\n\n\nMyoko Kogen Station\nNagano station\nNagano Station\nSnow Monkey Park\n\n\n\n\n08:39\n09:23\n–\n–\n\n\n09:08\n09:52\n10:20\n11:07\n\n\n10:42\n11:26\n12:15\n13:02\n\n\n\n\n\n\n\n\nSnow Monkey Park\nNagano station\nNagano Station\nMyoko Kogen Station\n\n\n\n\n14:00\n14:55\n15:12\n15:56\n\n\n15:50\n16:45\n17:01\n17:46\n\n\n16:50\n17:45\n18:14\n18:59\n\n\n\n\n\nTAXI\nThis is great option for convenience and speed. You can go at a time of your choosing and head there directly. The taxi company also parks closer to the actual Jigokudani Monkey Park area which means you don’t have to walk as far to the park entrance. This is a good option for families or groups of people who can split the cost among themselves.\nThe local Taxi company Kogen Taxi offers a monkey park service that is used by many visitors each year. They can collect you from your hotel and then drop you back again. Please ask your hotel front desk to book the taxi for you. If they are unable to do so, please send us an e-mail and we will try to assist you.\nPrices below are the cost for a round trip, so there and back again.\n\nMedium Taxi 1-4 people: 33,000 yen\nLarge Taxi 9 people: 46,000 yen \n\n\n\n\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/takada-park-cherry-blossoms/","title":"Takada Park Cherry Blossoms","description":"Takada Park is one of the most famous spots in Japan to view the cherry blossoms. The Park is famous for its evening light up, which is one of the best in Japan.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nTakada Park Cherry Blossoms\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenTakada Park Cherry BlossomsUpdated onJuly 15, 2018Places\nCherry Blossom Festival April 1st – 15th\nAs Winter draws to a close and Spring approaches, with the warming weather the cherry trees start to come to life.\nFrom the 1st of April to the 15th the 4,000 cherry blossoms will be in full bloom in Takada park. Takada park is one the most famous places in Japan to experience the blossoms at night. In the Evening the park is lit up and the cherry blossoms look even more spectacular.\nThe cherry blossoms are stunning at night.\nFor the Japanese, blossom viewing is also about enjoying great food! You will find many stores around the park selling all kinds of food from Tako Yaki, Kebabs, crepes and okonomiyaki.\nThe park area is distinctly split in half by the main road that runs through it. On weekends this road is closed off during the festival. On one side of the road you will find Takada Castle and the moat that runs around it. Here the castle and cherry blossoms reflect spectacularly in the moats waters. On the other side of the park you will find the Sakura Road. An area which is lit up at night with pink and blue lights. The road of cherry trees over-hang the whole path so there is a ceiling of pink blossoms all above you as you stroll along this spectacular path.\nSakura Road\nDuring the 2 weeks of the cherry blossom festival the area is very busy, especially in the evening. The best way to get to the park is either by train to Takada station then walk, or take the special bus below from Myoko to Takada Park.\nClick here for train times to Joetsu\nSPECIAL BUS SERVICE\nThis service runs only for the 2 weeks of the festival, from April 1st – 15th.This service allows you roughly 1hr 20min to view the blossoms before returning.Please make note of the bus departure point from Takada Park.\nAdult – 2,000 YenChild – 1,000 Yen (Child is under 12)\nYou need to book the shuttle in advance. You can do this by purchasing a ticket from the front desk of your hotel or the tourist office.\n\n\n\nBUS STOP\nTIME\n\n\n\n\nMyoko Kogen Tourist Office\n18:00\n\n\nTakahashi Ryokan\n18:04\n\n\nIkenotaira Landmark Cafe\n18:12\n\n\nAkakura Kanko Resort\n18:15\n\n\nAkakura Onsen Tourist Office\n18:17\n\n\nVIEWING TIME\n1hr 20min\n\n\nAkakura\n21:40\n\n\nMyoko Kogen\n22:00\n\n\n\n\n\n\nBUS STOP\nTIME\n\n\n\n\nTsubame Onsen\n18:20\n\n\nSeki Onsen Bus Stop\n18:25\n\n\nKyukamura Myoko\n18:27\n\n\nVIEWING TIME\n1hr 20min\n\n\nKyukamura Myoko\n21:50\n\n\nTsubame Onsen\n22:00\n\n\n\n\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/skunk-cabbages-at-imori-pond/","title":"Imori Pond Skunk Cabbages","description":"The skunk cabbages at Imori Pond are now in full bloom. Don't let the name of this plant put you off. These beautiful flowers plants grow in the shallow water areas around the pond.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nImori Pond Skunk Cabbages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSkunk Cabbages at Imori PondUpdated onApril 29, 2019Places\nSkunk Cabbages (mizubasho)\nEvery spring around the beginning of April, the mizubasho (skunk cabbages) come into bloom at Imori Pond. Don’t let the name of this plant put you off. These beautiful flowers plants grow in the shallow water areas around the pond and have a distinct beautiful white flower. \nImori Pond is one of the most scenic places to see these plants due to the stunning backdrop of Mt Myoko. \nAbout Skunk Cabbages\nSkunk cabbages are a herbaceous perennial that grow about 60-70cm tall, with strongly veined, green glossy leaves. In spring they have a fragrant, pointed white spathe that protects a central yellow spadix.\nThe asian skunk cabbage.\nThis scenic spring spot is very popular, especially as the blooming usually coincides with the Japanese golden week holidays period. The restaurant is also open. Bashouen is very popular as they offer a delicious all you can eat soba noodle and tempura menu.\n\n\n\n\nTo get to Imori Pond by bus check our local bus page.\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/sky-cable/","title":"Sky Cable","description":"Open from late July, ride the Sky Cable gondola up Mt Myoko to get some breath taking views of the valley below. A great place to take a walk.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSky Cable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMyoko Kogen Sky CableUpdated onJuly 18, 2018Places\nThe Myoko Sky Cable is the Akakura Kanko Resort gondola which takes you half way up Mt Myoko (1,300 meters) for some beautiful views of the area. It is open during the green season which runs from July until the beginning of November. The gondola costs ￥2,000 for adults and ￥1,000 for children. Pets are allowed to ride for free. Once at the top you will get some amazing views and can play on the rope swings and relax on the hammocks. The are some great trails that you can walk through the forest. There are guided tours you can also take, but these are in Japanese.\nAt the top is a small restaurant where you can get some food and drink as well as a delicious ice-cream. At the bottom of the gondola is the Kanko bakery that serves a variety of drinks and amazing freshly prepared sandwiches and other baked goods and sweets. If the weather is good, this is a beautiful place to take a walk and then have lunch. You will also be able to get some spectacular photos, especially if you visit in the autumn when the leaves are changing colour.\nSky Cable Ticket Price\nAdult: ￥2,000Child: ￥1,000\nFor information on how to reach Akakura Kanko Resort via bus check our bus timetable page HERE.\n\n\n\n\n\n\n\nLocation\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/koya-pond-hut/","title":"Koya Pond Mountain Hut - Myoko Tourism","description":"Koya Pond mountain hut situated next to the famous Koya Pond, between Mt Myoko (2454m) and Mt Hiuchi (2462m). You can now reserve the hut in English.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nKoya Pond Mountain Hut - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenKoya Pond Mountain HutKoya Pond Hutte is a mountain hut situated next to the famous Koya Pond, between Mt Myoko (2454m) and Mt Hiuchi (2462m). The new additional hut added in 2019 now allows up to 100 people to stay over night in the hut. We advise you to book early for the hut as during peak times all spaces can fill quickly. Please use the form below to make a booking enquiry.\nHut Fee\n\n\nFee\nNormal\nMyoko City Resident\n\n\n\n\nStay without meals\n8,000円\n6,000円\n\n\n2 meals\n11,500円\n9,500円\n\n\nDinner only\n10,000円\n8,000円\n\n\nLunch box (rice ball)\n600円\n600円\n\n\nPre Open (4/29～5/31)\n5,000円\n5,000円\n\n\n*During the pre-opening period, no meals will be provided, so only overnight stays will be accepted.*In the case of using a private room, an additional 6,000 yen per room will be added to the above rates. (Limited to 2 rooms per day)Camp GroundCamp fee (including toilet) 1,000 円 Per Person\n\nDoes not require prebooking.\nIf you use the campsite, please be sure to pay at the hut before setting up your tent.\nPlease take all garbage with you.\n\nCancel FeeApplies to groups of 10+7 days – No charge1 – 6 days – 50%On the day – 100%\nBookingTo book your place at Koya Pond Hut please compete the form below. We will check your information and get back to you to confirm your booking. Payment is at the hut when you check in. Only cash is accepted so please make sure you have sufficient money to pay for your booking when you go.\n*Completing the form IS NOT confirmation of booking. Please wait for us to respond and confirm your dates.\nFor those with some Japanese understanding you can book directly online here. DO NOT book on both the Japanese & English sites. You will end up with a double booking which we will likely cancel. Only book on one site please.\nOpen period: From April 29 2024 to October 29 2024 (planned)*Pre-opening period is from April 29th to May 31st.\n\nKoya Ike Booking \nYour DetailsFirst NameLast NameEmailPhone NumberHotel in MyokoYour StayCheck InMale GuestsCheck OutFemale GuestsChoose plan- Select -Basic stay (no meals)Stay with breakfast onlyStay with dinner onlyStay with breakfast and dinnerPrivate Room Private RoomYour RouteClimbing RouteStarting Point- Select -SasagamineAkakuraTsubamePlanned Start TimeYour Planned Route- Select -Start to Koya Pond Mountain HutStart to Mt Hiuchi summit then Koya Pond Mountain HutStart to Mt Myoko summit then Koya Pond Mountain HutKurosawa Hut to Mt Hiuchi summit then Koya Pond Mountain HutExpected Arrival Time at Koya Pond HutYour RouteDescending RouteYour Planned Route- Select -From Koya Pond Mountain Hut to exitKoya Pond Mountain Hut to Mt Hiuchi summit then exitKoya Pond Mountain Hut to Mt Myoko summit then exitKoya Pond Mountain Hut to Mt Hiuchi summit then Mt Myoko and exitExit Point- Select -SasagamineAkakuraTsubamePlanned Exit TimeSubmit Booking Form \nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/bike-rental/","title":"Bike Rental","description":"Rent road bikes directly from Myoko Kogen Tourist Office. The bike rental fee is very cheap making this a great way to see some of Myoko's best sights.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nBike Rental\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenBike RentalsUpdated onJune 19, 2024ActivitiesMyoko E-Bike RentalsE-bikes are available for rent at the Myoko Kogen Tourist Information Center. The rental price also includes the helmet fee. Please use it to visit sightseeing spots such as Imori Pond, Naena Falls, or even go further and visit Sasagamine and Lake Nojiri while breathing in the refreshing highland air.\nUsage period: From late April to the end of November (depending on snow conditions)\nMyoko Base Camp: 10 Bikes (sports type: 5, city cycle type: 5)Myoko Kogen Tourist Information Center: 5 Bikes (city cycle type)Myoko Kogen Sky Cable: 5 (city cycle type)Akakura Onsen Information Center: 3 Bikes (city cycle type)\nBike Rental Pricing\n\nBike Type\nHalf Day\nFull Day\n\n\n\nE-Bike\n3,000yen\n4,000yen\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/snow-reports/","title":"Snow Reports - Myoko Tourism","description":"Detailed snow reports for every resort in Myoko. Check daily for updated reports and resort news.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSnow Reports - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSnow ReportsWinterMYOKO WEATHER\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/season-passes/","title":"Season Passes","description":"Purchase the Mt Myoko 4 resort season pass and individual resort day tickets directly from our website.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSeason Passes\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMt Myoko All Mountain PassThe All Mountain Pass gives you access to all four resorts on Mt Myoko.Akakura Onsen Ski Resort, Akakura Kanko Ski Resort, Ikenotaira Alpen Blick Ski Resort & Suginohara Ski Resort.Mt Myoko All Mountain Pass is valid for the following dates\nAkakura Onsen Ski ResortDecember 14th until March 30th 2025\nAkakura Kanko Ski resortDecember 14th until March 31st 2025\nMyoko Suginohara Ski resortDecember 21st until March 23rd 2025\nIkenotaira Onsen Ski resortDecember 14th until March 30th 2025\nTerms & Conditions\n\nExpiration date is until the date designated by each ski area.\nDates above are subject to change depending on conditions.\nUse of pass is limited to the person named on the pass.\nPass may be revoked due to unauthorized use, forgery, or violation of ski area.\nNot valid for night & early morning skiing.\n\nMt Myoko + 3 Day PassEnjoy unlimited skiing at 4 Mt. Myoko area ski resorts PLUS 3 additional ski resorts! This new ticket includes an all-day shuttle bus pass connecting all the ski areas on the day you use the pass!Ticket Valid Period: 3 days until March 31, 2025 (can be used non-consecutively)*Please note the operating periods of each ski resort and shuttle bus service\n【Included Ski Resorts】Mt. Myoko Area 4 Ski Resorts:– Akakura Onsen Ski Resort– Akakura Kanko Resort– Ikenotaira Onsen Alpen Blick Ski Resort– Myoko Suginohara Ski Resort\nPlus 3 Additional Ski Resorts:– Arai Mountain Resort– Madarao Kogen Ski Resort– Tangram Ski Circus\n【Covered Bus Routes】– Mt. Myoko Shuttle (Akakura Onsen ⇔ Myoko Suginohara Ski Resort)– Lotte-Madarao Shuttle (Lotte Arai Resort ⇔ Akakura ⇔ Madarao Kogen)\nPurchase via our online store using the button below.\nPurchase Season Pass & TicketsTo Purchase the season pass & Mt Myoko+ ticket please click the link below. To purchase the individual resort tickets please use the form on this site and purchase them from this page.\nBus Pass: This extension to the season pass allows you to use the local Akakura – Suginohara resort bus for free for the whole season. Please note that it DOES NOT allow you to use other bus lines. Check here for the local bus operation period.\nMt Myoko All Mountain PassSeason PassPRICE105,000yenBus Pass  for Season Ticketsbus pass extensionPRICE+20,000yen3 Day All Resort Pass + Bus PassMt Myoko +PRICE+33,000yenPurchase the Season Pass & Mt Myoko +Purchase Early Bird Ski Resort TicketsPurchased tickets will not be refunded, reissued due to loss, or exchanged for cash under any circumstances. There will be no refunds or compensation if the ski resort's operating period is changed due to a lack of snow, or if there are lift closures or course restrictions due to bad weather or slope conditions. Please be aware of this before applying.Myoko Suginohara Ski Resort - Pre-Sale Day Pass (Smartphone App Exclusive)A First in Japan! Mobile Tickets Now Available for the Mt. Myoko Area!Price:Regular Adult Price: ¥7,000Special Pre-Sale Price: ¥6,500\nSales Period:December 21, 2024 – March 16, 2025\nValid Until:End of 2024-25 season (scheduled for March 23, 2025)Valid for one day of your choice during the season\nHow to Use:\n\n\n\nDownload the exclusive mobile ticket app\nPurchase your ticket and add it to the app\nPlace your phone in your left jacket pocket with the ticket activated when approaching the lift gates\nThe ticket will automatically connect to the gates via Bluetooth for seamless entry!\n\n\n\nSpecial Feature: Share your ticket with other devices by scanning the QR code using the distribution button!\nPurchase the Suginohara Pre-Sale TicketFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/snow-shoe/","title":"Snowshoe hire and tours","description":"Hire Snowshoes and take a snowshoe tour through the beautiful Myoko countryside. Hire your snowshoes and head off on your own adventure.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSnowshoe hire and tours\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSnowshoe CoursesUpdated onJuly 11, 2024SnowshoeThere are three courses but recently only the Squirrel course is usually marked out with numbered sign posts so you can easily find your way around the course. You should allow 2 hours for each course. The courses are unguided and free to access. You can print out our maps for reference. It is also a good idea to have a smart phone with navigation (google maps) just incase you lose your way.\nYou can hire snowshoes from the following rental shops.\nAoyama (Akakura & Shin Akakura) 1 Day rental at 2,500yen 10sets available\nDancing Snow (Shin Akakura) 1 Day rental with poles at 3,000yen 15 sets available.High quality Tubbs snowshoes.\nVisitor Center near Imori Pond (Ikenotaira) 1 Day rental 1,500yen 15 sets available.\nSquirrel Course - MarkedThe squirrel course takes you through woodland areas and then into an open snowfield area. If you only want to take a short tour then there is a short cut that cuts the course in half. This course is mostly flat and suitable for people of all level.Squirrel Course PDFFox Course - Not MarkedThe fox course takes you through some beautiful dense woodland areas. At the bottom of the course you loop round the fox pond before heading back up. The pond doesnt freeze so be careful not to walk on it. There are some uphill areas which makes this course a little tougher than the squirrel course.Fox Course PDFRabbit Course - Not MarkedThe rabbit course is the longest course and takes you up the ridge of Mt Myoko. There is an optional loop at the top of the course that you can take to get some great views of the surrounding mountains and area.Rabbit Course PDFFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/cross-country/","title":"Cross Country Course","description":"Myoko has a cross country course that is open for public use. The course found in Ikenotaira Onsen is used in national competitions.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nCross Country Course\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenCross Country SkiingUpdated onJuly 11, 2024WinterAkakura Kanko Resort Cross Country CourseThe All Japan Ski Federation Official Akakura Kanko Resort Cross Country Course is open from December to the end of March. It is open every day apart from New Years holiday and during competition time. The course is managed by Akakura Kanko Resort but the entrance to the course is in Ikenotaira Onsen at the Ikenotaira Onsen sports plaza. If you catch the bus to Landmark Onsen Cafe or Ikenotaira Ski Resort you can walk to the course easily.\nCross country skis can be rented from the visitor center at Imori Pond for 3,000yen.\n\nOpen Period: December 20th – March 31st\nOpen Time: 9:00 – 16:30\nHoliday: December 29th – January 3rd\nTelephone: 0255 86 5500 (Japanese Only)\nCourse Map: Click Here\n\nClosed for competition on these dates:\n\nwill be updated for coming 2024/25 season\n\n\n\n\nUSE\nU16\nAdult\n\n\n\n\nSeason Pass\n6,000\n12,000\n\n\nOne time use\n300\n600\n\n\nGroup use (30min)\n3,000\n3,000\n\n\nExclusive use (30min)\n7,500\n7,500\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/local-bus-service/","title":"Myoko local bus services","description":"Information and time tables on all the local bus services in Myoko. Using the local buses you can reach all areas of Myoko.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMyoko local bus services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenLocal bus serviceUpdated onDecember 10, 2024AccessTimetablesGreen Season Bus Pass(Not available in winter)You can purchase a 2 day bus pass for 1,000yen. Child (under 13) tickets are 500yen. Children under 6 ride for free.You can buy the pass at the tourist office & on the bus.This pass will allow you to ride freely on the following bus routes:\n\nAkakura Line\nSuginosawa Line\nSeki/Tsubame Onsen Line\nMyoko Sanroku Line\n\nAkakura Line\n\n\n\nMyokokogen Station\nShinAkakura Center\nAkakura Onsen\n\n\n\n\n07:09\n07:14\n07:24\n\n\n08:15\n08:25\n08:28\n\n\n09:27\n09:36\n09:40\n\n\n11:45\n12:06\n12:09\n\n\n14:15\n14:31\n14:34\n\n\n15:33\n15:52\n16:02\n\n\n16:45\n17:04\n17:14\n\n\n18:07\n18:23\n18:33\n\n\n19:06\n19:16\n19:19\n\n\n\n\n\n\n\nAkakura Onsen\nShinAkakura Center\nMyokokogen Station\n\n\n\n\n06:32\n06:36\n06:42\n\n\n07:34\n07:38\n07:53\n\n\n08:52\n08:56\n09:16\n\n\n09:47\n09:51\n10:03\n\n\n12:22\n12:26\n12:38\n\n\n14:47\n14:51\n14:59\n\n\n16:20\n16:24\n16:30\n\n\n17:32\n17:36\n17:42\n\n\n18:45\n18:49\n18:55\n\n\n\n\n\n\n\nBus Fare\n\n\n\n\n\n\nMyokokogen Station\n\n\n\n\n¥350\nShinAkakura Center\n\n\n\n¥380\n¥120\nAkakura Bus Stop\n\n\n\nSuginosawa Line\n\n\n\nMyokokogen Station\nVisitor Center\nSuginohara Ski Resort\nSuginosawa Onsen Center\n\n\n\n\n07:09\n07:19\n-\n07:22\n\n\n08:15\n08:25\n08:33\n08:36\n\n\n09:30\n09:51\n10:01\n10:04\n\n\n11:45\n12:06\n-\n12:11\n\n\n14:01\n14:22\n-\n14:27\n\n\n15:33\n15:55\n-\n16:00\n\n\n16:45\n17:07\n-\n17:12\n\n\n18:07\n18:28\n-\n18:31\n\n\n19:06\n19:16\n-\n19:19\n\n\n\n\n\n\n\nSuginosawa Onsen Center\nSuginohara Ski Resort\nVisitor Center\nMyokokogen Station\n\n\n\n\n06:32\n-\n06:35\n06:45\n\n\n07:32\n-\n07:36\n07:53\n\n\n08:47\n-\n08:52\n09:12\n\n\n10:17\n-\n10:22\n10:42\n\n\n12:32\n-\n12:37\n12:50\n\n\n14:47\n14:52\n15:00\n15:20\n\n\n16:09\n16:14\n16:22\n16:42\n\n\n17:32\n-\n17:37\n17:50\n\n\n18:42\n-\n18:45\n18:55\n\n\n\n\n\n\n\nBus Fare\n\n\n\n\n\n\n\nMyokokogen Station\n\n\n\n\n\n¥280\nVisitor Center\n\n\n\n\n¥480\n¥120\nSuginohara Ski Resort\n\n\n\n¥410\n¥180\n¥120\nSuginosawa Onsen Center\n\n\n\nSeki / Tsubame Onsen LineAll year service: Bus time marked with (*) no service on Saturdays, Sundays, National Holidays and 31 Dec-3 Jan.440yen to Seki Onsen & 500yen to Tsubame.\n\n\n\nBus Stop\n\n\n\n\n\n\n\n\n\n\n\nSekiyama Station\n*6:17\n07:46\n09:03\n10:49\n13:52\n15:30\n17:24\n\n\nKyukamura Myoko\n*06:28\n08:00\n09:25\n11:14\n14:14\n15:55\n17:46\n\n\nSeki Onsen\n*6:32\n08:04\n09:29\n11:18\n14:18\n15:59\n17:50\n\n\nTsubame Onsen\n*6:37\n08:09\n09:34\n11:23\n14:23\n16:04\n17:55\n\n\n\n\n\n\n\nBus Stop\n\n\n\n\n\n\n\n\n\n\n\nTsubame Onsen\n*6:38\n08:10\n09:38\n11:35\n14:34\n16:20\n18:01\n\n\nSeki Onsen\n*6:43\n08:15\n09:43\n11:40\n14:39\n16:25\n18:06\n\n\nKyukamura Myoko\n*6:47\n08:19\n09:47\n11:44\n14:43\n16:29\n18:10\n\n\nSekiyama Station\n*7:09\n08:41\n10:12\n12:06\n15:08\n16:51\n18:32\n\n\n\nSasagamine BusOperates daily from July 8th 2024 to October 27th 2024Children (under 13) half price. Pre school child are free.\n\n\n\nBus Stop\nFare\nNo.1\nNo.3\nNo.5\n\n\n\n\nMyokokogen Station\n–\n07:20\n09:40\n14:20\n\n\nIkenotaira Imori Pond\n¥280\n07:29\n09:49\n14:29\n\n\nSuginosawa Onsen\n¥410\n07:34\n09:54\n14:34\n\n\nKenmin no Mori\n¥1,000\n07:59\n10:19\n14:59\n\n\nSasagamine\n¥1,000\n08:10\n10:30\n15:10\n\n\n\n\n\n\n\nBus Stop\nFare\nNo.2\nNo.4\nNo.6\n\n\n\n\nSasagamine\n–\n08:20\n13:15\n16:00\n\n\nKenmin no Mori\n¥300\n08:31\n13:26\n16:11\n\n\nSuginosawa Onsen\n¥700\n08:56\n13:51\n16:36\n\n\nIkenotaira Imori Pond\n¥700\n09:01\n13:56\n16:41\n\n\nMyokokogen Station\n¥1,000\n09:10\n14:05\n16:50\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/winter-bus-service/","title":"Myoko winter bus service","description":"Information and time tables on all the winter bus services in Myoko. Find bus times to all major resorts. Tangram, Madarao, Lotte Arai, Akakura, Suginohara.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMyoko winter bus service\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenWinter bus serviceUpdated onJanuary 1, 2025AccessMt Myoko ShuttleDecember 21st – March 23rdNO RESERVATION REQUIREDPRICE: ¥1000 ONE WAYAkakura – Suginohara ShuttleServices with a * mark will start operation from January 6th\n\n\n\nAkakura Onsen\nAkakura Kanko\nHotel Windsor\nAlpen Blick Spa\nIkenotairaSki Resort\nIkenotairaTourist Office\nIkenotairaLime Resort\nSuginosawaFire Station\nSuginoharaSki Resort\n\n\n\n\n8:00\n8:02\n8:05\n8:12\n8:15\n8:18\n8:19\n8:23\n8:27\n\n\n*8:30\n8:32\n8:34\n8:40\n8:45\n8:48\n8:49\n8:53\n8:57\n\n\n9:00\n9:02\n9:04\n9:10\n9:15\n9:18\n9:19\n9:23\n9:27\n\n\n*9:30\n9:32\n9:34\n9:40\n9:45\n9:48\n9:49\n9:53\n9:57\n\n\n10:00\n10:02\n10:04\n10:10\n10:15\n10:18\n10:19\n10:23\n10:27\n\n\n－\n－\n－\n－\n－\n－\n－\n－\n－\n\n\n*15:00\n15:02\n15:04\n15:10\n15:15\n15:18\n15:19\n15:23\n15:27\n\n\n15:30\n15:32\n15:34\n15:42\n15:45\n15:48\n15:49\n15:53\n15:57\n\n\n*16:00 \n16:02\n16:04\n16:10\n16:15\n16:18\n16:19\n16:23\n16:27\n\n\n\nSuginohara – Akakura ShuttleServices with a * mark will start operation from January 6th\n\n\n\nSuginoharaSki Resort\nSuginosawaFire Station\nIkenotairaLime Resort\nIkenotairaTourist Office\nIkenotairaSki Resort\nAlpen Blick Spa\nAkakura Kanko\nAkakura Onsen\nHotel Windsor\n\n\n\n\n8:30\n8:33\n8:38\n8:39\n8:45\n8:47\n8:56\n8:58\n-\n\n\n*9:00\n9:03\n9:08\n9:09\n9:15\n9:17\n9:26\n9:28\n-\n\n\n9:30\n9:33\n9:38\n9:39\n9:45\n9:47\n9:56\n9:58\n-\n\n\n－\n－\n－\n－\n－\n－\n－\n－\n－\n\n\n*14:15\n14:18\n14:23\n14:24\n14:30\n14:33\n14:41\n14:43\n-\n\n\n15:00\n15:03\n15:08\n15:09\n15:15\n15:17\n15:25\n15:27\n-\n\n\n*15:30\n15:33\n15:38\n15:39\n15:45\n15:47\n15:56\n15:58\n-\n\n\n16:00\n16:03\n16:08\n16:09\n16:15\n16:17\n16:26\n16:28\n16:30\n\n\n*16:30\n16:33\n16:38\n16:39\n16:45\n16:47\n16:56\n16:58\n17:02\n\n\n\nLotte Arai Resort & Madarao ShuttleJanuary 6th – March 10thNO RESERVATION REQUIREDLotte Arai Resort – Akakura – Madarao\n\n\nLotte Arai Resort\nAkakura Onsen Ski Resort\nAkakura Kanko Resort\nHotel Windsor\nMyoko Kogen Bus Terminal\nTangram\nMadarao\n\n\n\n7:20\n8:05\n8:07（8:00）\n8:09\n8:12\n8:30\n8:50\n\n\n8:55\n10:00\n10:02（9:35）\n10:04\n10:10\nー\nー\n\n\n14:00\n14:45\n14:47（14:40）\n14:49\n14:55\n15:15\n15:35\n\n\n16:00\n16:50\n16:53\n16:56\n16:40\nー\nー\n\n\n\nMadarao – Akakura – Lotte Arai Resort\n\n\nMadarao\nTangram\nMyoko Kogen Bus Terminal\nHotel Windsor\nAkakura Kanko Resort\nAkakura Onsen Ski Resort\nLotte Arai Resort\n\n\n\nー\nー\n8:00\n8:14\n8:12\n8:10\n8:55\n\n\n9:00\n9:15\nー\nー\n9:50\n9:45\n10:30\n\n\nー\nー\n15:00\n15:15\n15:13\n15:10\n16:00\n\n\n15:40\n16:00\n16:20\n16:30\n16:26\n16:28\n17:10\n\n\n\nRoute Price Chart\n\n\n\nLotte Arai Resort\n\n\n\n\n\n\n\n\n2000yen\nAkakura Onsen Ski Resort\n\n\n\n\n\n\n\n2000yen\n500yen\nAkakura Kanko Resort\n\n\n\n\n\n\n2000yen\n500yen\n500yen\nHotel Windsor\n\n\n\n\n\n2000yen\n500yen\n500yen\n500yen\nMyoko Kogen Bus Terminal\n\n\n\n\n3200yen\n1500yen\n1500yen\n1500yen\n1500yen\nTangram\n\n\n\n3600yen\n2000yen\n2000yen\n2000yen\n2000yen\n600yen\nMadarao\n\n\n\nSnow Monkey Shuttle BusDecember 23rd – March 9thNO RESERVATION REQUIREDAkakura – Monkey Park: 5,000 JPYLotte Arai Resort – Monkey Park: 8,000 JPYTickets are returns.Please pay cash before you board the bus.\n\n\nBus Stop\nTime\n\n\n\n\nLotte Arai Resort\n9:10\n\n\nAkakura Onsen Ski Resort\n10:00\n\n\nAkakura Kanko Resort\n10:02\n\n\nHotel Windsor\n10:04\n\n\nMyoko Kogen Bus Terminal\n10:10\n\n\nSnow Monkey Park\n11:10\n\n\n\n\n\nBus Stop\nTime\n\n\n\n\nSnow Monkey Park\n14:00\n\n\nMyoko Kogen Bus Terminal\n15:00\n\n\nAkakura Onsen Ski Resort\n15:10\n\n\nAkakura Kanko Resort\n15:13\n\n\nHotel Windsor\n15:15\n\n\nLotte Arai Resort\n16:00\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/by-airport-shuttle/","title":"Airport shuttle services","description":"Get an airport shuttle to Myoko from Narita, Haneda, Toyama and Niigata airports.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nAirport shuttle services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenBy Airport ShuttleUpdated onAugust 29, 2024AccessMyoko Shuttle ServiceNarita/Haneda : From ¥10,000 one wayMyoko Shuttle offers direct transfer from Narita, Haneda and Niigata airports with three shuttles per day. This is the cheapest shuttle service available, and the route also stops in Madarao, Tangram and at Lotte Arai Resort.\nMyoko Shuttle also operate the local resort buses. This season they are offering a half price pass on the local buses to customers that purchase a return journey on their airport shuttles.\nMyoko ShuttleNagano Snow ShuttleNarita/Haneda : From ¥11,500  one wayNagano Snow Shuttle have been transferring people to and from Narita and Haneda for many years and were the first dedicated airport shuttle service in the area. They are an established service and offer up to 4 buses a day which can very convenient depending on when you land. Most services require a change of shuttle in Nagano.\nThey also have daily shuttles to and from Hakuba and Nozawa Onsen.\nNagano Snow ShuttleFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/local-taxi-service/","title":"Local taxi service","description":"All the prices and information on Myoko Kogens local taxi service. Prices to all popular destinations.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nLocal taxi service\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenLocal taxi serviceUpdated onJuly 8, 2024AccessKogen TaxiTel: 0255-86-3141 (Japanese only)Payment for taxis is cash only.Kogen taxi has been serving Myoko Kogen for over 50 years. They have a fleet of modern cars and can get to places that buses don’t run to. If you are with a group splitting the cost of a taxi can be a more cost-effective way of getting to some places. The staff at the taxi company don’t speak English but don’t worry it is still very easy to book a taxi. The best way is to ask at your hotel front desk and they can arrange the taxi for you. Please note that we can not book taxis for you via e-mail. If you walk in to the tourist office we can arrange a taxi for you.Prices below are from Akakura onsen area unless stated. If you ride the taxi from a different location the price will be different. Please also be aware that the price is a guide and may change slightly due to time/distance etc.MEDIUM TAXI4 – 5 peopleLARGE TAXI9 peopleGreen Season Price ListThese prices are from Myoko Kogen train station.\n\n\n\nSasagamine\nNaena Waterfall\nImori Pond\nSky Cable\nAkakura Onsen\nDaidohara Field\nSeki Onsen\nTsubame Onsen\n\n\n\n\n¥6,500\n¥3,000\n¥1,600\n¥1,600\n¥2,000\n¥2,000\n¥3,300\n¥4,200\n\n\n\nWinter Season Price ListThese are guideline prices when riding from Akakura Onsen.Ski Resorts\n\n\n\nDestination\nMedium Taxi\nLarge taxi\n\n\n\n\nLotte Arai\n11,200\n15,500\n\n\nSuginohara\n3,900\n5,400\n\n\nSeki Onsen\n6,400\n8,700\n\n\nMadarao\n9,400\n13,000\n\n\nTangram\n7,700\n10,700\n\n\nNozawa\n21,000\n29,500\n\n\n\nTrain Stations\n\n\n\nDestination\nMedium Taxi\nLarge taxi\n\n\n\n\nMyoko Kogen\n3,000\n4,100\n\n\nJoetsu Myoko\n13,500\n18,800\n\n\nKurohime Kogen\n6,900\n9,600\n\n\nNagano City\n18,000\n25,200\n\n\n\nSushi\n\n\n\nDestination\nMedium Taxi\nLarge taxi\n\n\n\n\nTakasago\n3,200\n4,400\n\n\nMiyagawa\n2,700\n3,700\n\n\nSushiyoshi\n10,400\n14,500\n\n\n\nAirports\n\n\n\nDestination\nMedium Taxi\nLarge taxi\n\n\n\n\nNarita\n103,000\n132,000\n\n\nHaneda\n90,000\n113,000\n\n\nToyama\n46,000\n59,000\n\n\nNiigata\n51,000\n66,000\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/car-rental/","title":"Car Rentals","description":"Renting a car is a great way to get around Myoko. It offers the ultimate freedom to explore the area. Please read our car rental guide about renting a car in Japan, specially during the winter season.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nCar Rentals\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenCar RentalUpdated onAugust 14, 2024AccessCar rental can be a great way to get around Japan and Myoko. Japan has an amazing highway system and great roads making it a perfect place to navigate via car.Myoko has many buses that can take you to all the popular resort areas and tourist spots but the flexibility of your own vehicle allows you to visit any place at any time. There are also some areas that buses don’t go past that you can only reach by car.Winter Car RentalsDO NOT COME TO MYOKO WITH OUT SNOW TYRESIf you are planning to rent a car during winter in Myoko it is very important that you follow this information.You will need a car equipped with snow tyres. This is not optional but a total necessity. You must have winter tyres on your rental car. If not, you will find you are unable to drive in Myoko and you may even have a dangerous accident.Snow tyres are an optional extra when booking your car. If you are collecting your car from Narita/Tokyo and other areas except those mentioned below it will cost an aditional amount per day depending on car class.If you are collecting your car from a snowy area such as as Niigata, Nagano, Tohoku, Hokkaido etc the snow tyres are free of charge in the winter season.We also highly recommend a 4WD car during winter.There is also an additional charge per day for 4WD. 4WD and snow tyres are limited so please be sure to book in advance.Car Rental CompaniesNippon Rent-A-CarWe offer a 5% discount on your rental car when you use this code.COUPON CODE: 1rv83Qvy67Nippon Rent-A-Car have a full English car rental service that makes it very easy to find and reserve a car as well as get help if you need it. Their cars can also be equipped with ETC cards for convenient highway travel which requires a toll fee. You can also add a navigation system to your car and connect your music device to most vehicles.\n\n850 offices accross Japan\nFleet of new cars\nOne-way car rentals\nEnglish GPS\nETC card rental option\n\nPick up is available near Nagano station and Joetsu Myoko station.\nNippon Rent-A-CarFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/dining-soratobu-usagi/","title":"Dining Soratobu Usagi - Myoko Tourism","description":"Try handrolled sushi. This is a delicious dish you make yourself.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nDining Soratobu Usagi - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenDining Soratobu UsagiPlaces to EatOpen Season: All YearPrice Range: from ￥800 - ￥2,500HAND ROLLED SUSHI !\n¥1500~¥2500 per personTry handrolled sushi. This is a delicious dish you make yourself.Place rice on top of a sheet of seaweed, then put the sashimi on top. Wrapped the rice and sashimi in the seaweed sheet and then eat it. Its delicious and fun!\nWe also have vegetarian menu without the sashimi.\nPlease make a reservation 2 days in advance for hand rolled sushi.\n\nMENU\n\nNo reservation needed\n\nVegetable rice Curry\nChicken bowl on rice\nBeef bowl on rice\nSpaghetti with meat sauce\nPork cutlet with bread\nChicken cutlet with bread\n\n\nDRINKS\n\nSake, Shochu, Beer, WineJuice, Tea, Coffee etc.\nOpen HoursMonday11AM - 1PM & 5PM - 8PMTuesday11AM - 1PM & 5PM - 8PMWednesday11AM - 1PM & 5PM - 8PMThursday11AM - 1PM & 5PM - 8PMFriday11AM - 1PM & 5PM - 8PMSaturdayCLOSEDSunday11AM - 1PM & 5PM - 8PMFacilitiesEnglish MenuEnglish SpeakerTakes ReservationsAccepts Credit CardsGood for familiesGood for GroupsVegetarianVeganWifiAlcoholNo SmokingParkingAll YearAddress〒949-2113 Niigata, Myoko, 大字 杉野沢229−2Phone Number0255-86-6969Homepagehttps://www.soratobuusagi.comEmail[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/koyama/","title":"Koyama - Myoko Tourism","description":"Situated close to the ski slope, just above the main street. Koyama is a family run restaurant providing generous servings of Japanese food.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nKoyama - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenKoyamaPlaces to EatOpen Season: All YearPrice Range: from ¥800 - ¥1,200Situated close to the ski slope, a convenient location just above the main street. Koyama is a family run restaurant providing generous servings of Japanese food.\nLunch: 11:00 – 15:00Dinner: 17:00 – 22:00\nCash Only.\nSpecialities\nHandmade gyoza is one of our most popular dishes. We can do it for take out.Our garlic chicken set meal is another very popular dish with many guests.\nOpen HoursEveryday11AM - 3PM & 5PM - 10PMFacilitiesEnglish MenuEnglish SpeakerTakes ReservationsGood for familiesGood for GroupsTake-outAlcoholAll YearAddress549 Akakura, Myoko, Niigata 949-2111Phone Number0255872792HomepageEmailFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/arakin-ramen/","title":"Arakin Ramen - Myoko Tourism","description":"Located on the opposite corner from Landmark Myokokogen, Arakin Ramen specializes in the essential Japanese food - ramen noodles.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nArakin Ramen - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenArakin RamenPlaces to EatOpen Season: All YearPrice Range: from ￥600 - ￥2,000Located on the opposite corner from Landmark Myokokogen, Arakin Ramen specializes in the essential Japanese food—ramen noodles. More like a coffeehouse-style spot for lunch, at night it serves local beer and local saké, becoming more of an izakaya.\nSpecialties\n\nChashu kyabetsu (braised pork and cabbage)\nNegi chashu (leeks and thin sliced pork)\nChashu nin’ ninku gohan (pork fried rice with garlic)\nShio chashumen (salt-flavored ramen noodle with thin sliced pork)\n\nOpen HoursEveryday9:00 - 23:00FacilitiesEnglish MenuTakes ReservationsAccepts Credit CardsGood for familiesGood for GroupsVegetarianWifiTake-outAlcoholParkingAll YearAddress2417-15 Sekigawa, Myoko, Niigata 949-2112Phone Number0255862150HomepageEmailFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/two-pines/","title":"TWO PINES - Myoko Tourism","description":"Join us at Two Pines, a pizzeria in the heart of Suginosawa village. Serving authentic stonebaked pizza and the best après vibes.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nTWO PINES - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenTWO PINESPlaces to EatOpen Season: Winter OnlyPrice Range: from ￥1,900 - ￥2,500After a day shredding the slopes, join us at Two Pines, a pizzeria nestled in the heart of Suginosawa village, Myoko Kogen. Serving authentic stonebaked pizza and the best après vibes, our newly refurbished pizza bar is waiting to welcome for afternoon après, and a cozy dinner. \nLocated five minutes from Suginohara Ski Resort, Two Pines is easy to access by foot, car, or the local bus – which stops right outside. Our warm, stylish space is open daily from 5 – 8:30pm, and we offer takeaways for the nights you feel like staying in.  \nWe also have a large range of quality snowboard and ski hire suitable for all abilities.\nCome for the pies, stay for the vibes!\nOpen HoursEveryday5:30 - 8:30FacilitiesEnglish MenuEnglish SpeakerAccepts Credit CardsGood for familiesGood for GroupsVegetarianWifiTake-outAlcoholNo SmokingWheelchair AccessibleAddress2436-3 SuginosawaPhone NumberHomepagehttps://twopinespizza.square.site/Email[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/japan-snowsports/","title":"Japan Snowsports - Myoko Tourism","description":"Japan Snowsports organize occasional dinners. Enjoy a 6-course dinner together with the other guests at one big table in our dining room that fits a maximum of 20 guests.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nJapan Snowsports - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenJapan SnowsportsPlaces to EatOpen Season: Winter OnlyPrice Range: from ￥1,300 - ￥4,500Because snow, beautiful food and great customers service is in our DNA, Japan Snowsports organize occasional dinners. Enjoy a 6-course dinner together with the other guests at one big table in our dining room that fits a maximum of 20 guests. Interact with the chef who you see at work through the open. In our dinners we unite different corners of the world whilst respecting the Japanese notion of ‘shun’ (season). The dinners are accompanied with home-made sourdough bread and you can choose to add on accompanied drinks. Travel through the region while tasting the different flavours of the mountains. Don’t miss out on these nights! Keep an eye on our social media channels (@japansnowsports) or contact us for a reservation.\nOpen HoursFacilitiesEnglish MenuEnglish SpeakerTakes ReservationsAccepts Credit CardsGood for familiesGood for GroupsVegetarianWifiAlcoholNo SmokingWinter OnlyAddressMadarao, Japan 1101-59, Iiyama, Nagano 389-2261Phone Number08081234131Homepagehttps://jpsnowsports.comEmail[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/yabu-soba/","title":"Yabu Soba - Myoko Tourism","description":"A family run restaurant that has been serving Japanese soba and udon noodles for over 60 years.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nYabu Soba - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenYabu SobaPlaces to EatOpen Season: All YearPrice Range: from ￥600 - ￥1,500A family run restaurant that has been serving Japanese soba and udon noodles for over 60 years. You can enjoy your meal at the table, sitting on tatami mats or at the counter in the restaurant. From one person to a large group all are welcome, please come and try our great food.\nWe have various kinds of sake including some rare brands.\nOur most popular dish is our tempura soba and tempura udon. Other popular dishes include ramen, donburi (various toppings on rice), yudofu (simmered tofu), oden, grilled squid and tonkatsu (pork cutlet).Enjoy our food with beer and local sake.\nPlease make a reservation by telephone if a large group.\nCash only. We dont accept credit cards.\nOpen HoursMonday11AM - 2PM & 5PM - 8PMTuesdayCLOSEDWednesday11AM - 2PM & 5PM - 8PMThursday11AM - 2PM & 5PM - 8PMFriday11AM - 2PM & 5PM - 8PMSaturday11AM - 2PM & 5PM - 8PMsunday11AM - 2PM & 5PM - 8PMFacilitiesEnglish MenuEnglish SpeakerTakes ReservationsGood for familiesGood for GroupsVegetarianVeganTake-outAlcoholNo SmokingWheelchair AccessibleParkingAll YearAddress720-1 Sekigawa, Myoko, Niigata 949-2112Phone Number0255862146HomepageEmailFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/hanako/","title":"Hanako - Myoko Tourism","description":"Handmade soba noodles are the focus at lunch (but with other specialties as well); at night Hanako becomes an izakaya. In Landmark Myokokogen.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nHanako - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenHanakoPlaces to EatOpen Season: All YearPrice Range: from ￥600 - ￥2,000About Us\nHandmade soba noodles are the focus at lunch (but with other specialties as well); at night Hanako becomes an izakaya. Easy to find in Landmark Myokokogen.\nLunchTantan men(spicy ramen with mince meat in sesame soup)Myoko-san set lunch featuring handmade sobaMyoko Hinode tare katsudon (Myoko Sunrise pork cutlet with tare sauce, on rice bowl)Myoko-san yaki chizu katsu kare (Myoko pork cutlet and melted cheese with curry)\nIzakayaGrilled pork skewers, sashimi, and much more.\nOpen HoursEveryday11:00 - 12:00FacilitiesEnglish MenuGood for familiesGood for GroupsVegetarianWifiAlcoholWheelchair AccessibleParkingAll YearAddress2413-11 Sekigawa, Myoko, Niigata 949-2112Phone Number0255865130Homepagehttp://www.onsencafe.com/index.htmlEmail[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/panorama-cafe-dining/","title":"Panorama Café & Dining - Myoko Tourism","description":"Panorama serves a fusion of Japanese and International cuisine, showcasing classic Japanese food and contemporary international flavors.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nPanorama Café & Dining - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenPanorama Café & DiningPlaces to EatOpen Season: Winter OnlyPrice Range: from ￥500 - ￥5,000Named for the beautiful view across the Myoko valley, Panorama serves a fusion of Japanese and International cuisine, showcasing the intersection of classic Japanese food and contemporary international flavors.\nLocated at Myoko Snowsports Village Shop in Akakura, coffee and morning bites are available from 8am, lunch & après drinks through the day, and dinner service to 9:30pm. Dinner reservations are recommended to ensure availability.\nMenus are guided by the freshest local ingredients and seasonal harvests. The menu includes a selection of soup, salmon, scallops and vegetarian & vegan bowls. Cakes, muffins and other goodies are prepared fresh each day.\nFOODA selection of meats, vegetarian & vegan dishes and cakes.\n\nDRINKSFresh coffee, tea, wine, cocktails, spirits, champagne & beer.\n\nSpecialities\n\nBarista prepared coffee\nCakes baked in-house\nFresh Japanese salmon & scallops\nVegetarian & vegan bowls\nExpertly prepared cocktails\nGluten free options\n\nOpen HoursMonday8:00 - 18:00Tuesday8:00 - 21:30Wednesday8:00 - 21:30Thursday8:00 - 21:30Friday8:00 - 21:30Saturday8:00 - 21:30Sunday8:00 - 21:30FacilitiesEnglish MenuEnglish SpeakerTakes ReservationsAccepts Credit CardsGood for familiesGood for GroupsVegetarianVeganWifiTake-outAlcoholNo SmokingWheelchair AccessibleParkingMusicWinter OnlyAddress585-74 Akakura, Myoko City, Niigata 949-2111Phone Number080-3247-1776Homepagehttps://myokosnowsports.com/akakura/panorama/Email[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/restaurant-shibata/","title":"Restaurant Shibata - Myoko Tourism","description":"Shibata is one of the most popular restaurants in Myoko. We have a large menu with options for everyone including vegetarians and vegans.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nRestaurant Shibata - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenRestaurant ShibataPlaces to EatOpen Season: Winter OnlyPrice Range: from ￥1,000 - ￥2,500During the winter season Shibata is one of the most popular restaurants in Myoko. We are situated on the main street in Akakura and are very easy to find. We have a large menu with options for everyone including vegetarians and vegans.Shibata moved to its current location in 2008. After more than half a century in Akakura we continue to strive to preserve the friendly family run atmosphere that was created back when we originally opened the restaurant.\nWe hope you enjoy your time in Akakura Onsen and look forward to serving you at Restaurant Shibata.\nLUNCH – 11:00 – 14:00DINNER – 17:00 – 21:00\nOur Rice\nShibata sources all its rice from the Yamakawa family farm in Myoko. The rice is called Koshihikari rice and is famous for the snow-melt from the mountain that irrigates the rice fields each spring. Although the farm is small the Yamakawa farms rice consistently receives Japans highest Rice Grading Certification and exports it produce internationally.\nAt Shibata we cook rice fresh each evening, using pure, fresh water straight from the mountains in Myoko-Togakushi National Park behind Akakura, so you can enjoy your rice at its very best.\nOpen HoursEveryday1AM- 2PM & 5PM - 9PMFacilitiesEnglish MenuEnglish SpeakerAccepts Credit CardsGood for familiesGood for GroupsVegetarianVeganWifiTake-outAlcoholNo SmokingWheelchair AccessibleWinter OnlyAddress549-8 Akakura, Myoko, Niigata 949-2111Phone Number0255872936Homepagehttps://restaurantshibata.comEmailFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/waremoko/","title":"Waremoko - Myoko Tourism","description":"Right opposite the entrance to the Akakura Kanko Ski Area, Waremoko provides good, filling Japanese flavors.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nWaremoko - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenWaremokoPlaces to EatOpen Season: All YearPrice Range: from ￥800 - ￥1,200Filling Japanese dishes\nRight opposite the entrance to the Akakura Kanko Ski Area, Waremoko provides good, filling Japanese flavors. Relax and look over the full menu of dishes; enjoy a cold beer, saké or other beverages.\nSpecialities\nMiso ramen (ramen in a miso-flavored base), katsu kare (curry with pork cutlet), katsu don (fried pork cutlet on rice), gyoza, crêpes.\nLunch: 11:00 – 14:00Dinner: 17:00 – 20:00\nCash only. We dont accept credit cards\nOpen HoursEveryday11M - 2PM & 5PM - 8PMFacilitiesEnglish MenuGood for familiesAlcoholParkingMusicAll YearAddressTagiri, Myoko, Niigata 949-2102Phone Number0255872727HomepageEmailFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/yakiniku-yoroku/","title":"Yakiniku Yoroku - Myoko Tourism","description":"We have a substantial menu with dishes suitable for everyone from families to large groups. Everything is homemade, we use no frozen & pre packaged foods.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nYakiniku Yoroku - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenYakiniku YorokuPlaces to EatOpen Season: Winter OnlyPrice Range: from ￥1,000 - ￥4,000Japanese wagyu yakiniku\nWe have a substantial menu with dishes suitable for everyone from families to large groups. Everything is homemade, we use no frozen & pre packaged foods.\nLunch: 11:30 – 14:00Dinner 17:00 – 21:00\nOur specialties are Japanese wagyu beef and pork Yakiniku.We offer a lunchtime Yakiniku set meal.\nRecommended side dishes:\n\nHomemade Gyoza made of 80% vegetables and 20% meat.\nCheese Gyoza with our original Wasabi mayonnaise sauce.\ngrilled vegetables\nsalad\nlocal sake\nKoshihikari rice\nBBQ fried rice\n\nOpen HoursEveryday11:30AM- 2PM & 5PM - 9PMFacilitiesEnglish MenuEnglish SpeakerTakes ReservationsAccepts Credit CardsGood for familiesGood for GroupsVegetarianTake-outAlcoholWinter OnlyAddress585-80 Akakura, 大字, Myoko, Niigata 949-2111Phone Number0255872838HomepageEmail[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/kanouya/","title":"Kanouya - Myoko Tourism","description":"We are an Italian restaurant situated in the mountain area of Myoko. We are right next to Seki Onsen ski resort.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nKanouya - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenKanouyaPlaces to EatOpen Season: All YearPrice Range: from ￥1,000 - ￥10,000We are an Italian restaurant situated in the mountain area of Myoko.We are right next to Seki Onsen ski resort, so a great choice for lunch or dinner if you are at Seki Onsen.From May to November we only serve full course meals which require a reservation.\nWe serve delicious lamb dishes, as well as a variety of pasta dishes.We also have a selection of delicious desserts.\nPlease make a reservation, either via phone or E-mail.Cash only, credit cards not accepted.\nOpen HoursEveryday11AM - 3PM & 5:30PM - 10PMFacilitiesEnglish MenuEnglish SpeakerTakes ReservationsGood for familiesVegetarianTake-outAlcoholAll YearAddress6087-5 Sekiyama, Myoko, Niigata 949-2235Phone Number0255822327Homepagehttp://www.kanouya.bizEmail [email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/lime-bar/","title":"LIME BAR - Myoko Tourism","description":"Please relax and spend time in this luxurious atmosphere after your snow activities. Open 18:00～24:00（L.O 23:30）","language":"en-US"},"page_content":"\n\n\n\n\n\n\nLIME BAR - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenLIME BARPlaces to EatOpen Season: All YearPrice Range: from ￥500 - ￥5,000Please relax and spend time in this luxurious atmosphere after your snow activities.Open 18:00～24:00（L.O 23:30）\nOpen HoursEveryday6PM - 12AMFacilitiesEnglish MenuAccepts Credit CardsGood for GroupsWifiAlcoholNo SmokingWheelchair AccessibleParkingMusicAll YearAddress2251-2 Sekigawa, Myoko, Niigata 949-2112Phone Number0255755115Homepagehttps://lime.myoko-hotel.comEmailFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/eika/","title":"Eika - Myoko Tourism","description":"Eika is the sole restaurant serving only Chinese food in the Akakura/Ikenotaira area. Close to Landmark Myokokogen.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nEika - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenEikaPlaces to EatOpen Season: All YearPrice Range: from ￥600 - ￥1,800Eika is the sole restaurant serving only Chinese food in the Akakura/Ikenotaira area. Close to Landmark Myokokogen, the husband-and-wife team turn out a variety of rich and warming Chinese dishes.\nLunch: 11:30 – 14:00Dinner: 17:30 – 21:00\nCash only\nSpecialities\n\nChinjao rosu (stir-fried pork and peppers)\nGyoza\nEbi chiri (shrimp in chili sauce)\nStir-fried chicken with cashews\nFried chicken\nVariety of ramen and fried noodle dishes.\n\nOpen HoursMonday11:30 - 2PM & 5:30PM - 9PMTuesdayCLOSEDWednesday11:30 - 2PM & 5:30PM - 9PMThursday11:30 - 2PM & 5:30PM - 9PMFriday11:30 - 2PM & 5:30PM - 9PMSaturday11:30 - 2PM & 5:30PM - 9PMSunday11:30 - 2PM & 5:30PM - 9PMFacilitiesEnglish MenuTakes ReservationsGood for familiesTake-outAlcoholNo SmokingParkingAll YearAddress〒949-2112 Niigata, Myoko, 池ノ平2307−25Phone Number 0255863072HomepageEmailFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/%e5%85%ab-eight/","title":"八 Eight - Myoko Tourism","description":"A Japanese bar and restaurant. We offer a wide variety of foods for you to enjoy with your family and friends.","language":"en-US"},"page_content":"\n\n\n\n\n\n\n八 Eight - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsen八 EightPlaces to EatOpen Season: Winter OnlyPrice Range: from ￥2,000 - ￥3,500We are a Japanese bar and restaurant. We offer a wide variety of foods for you to enjoy with your family and friends. Enjoy our fried chicken, grilled foods, sushi and much more!\nTo check out our parties and events please follow our instagram @eight_akakura. \nOur friendly staff also enjoy spending their time on the mountain so please come and chat with us about your time in Myoko.\nSpecialities\n\nSashimi\nEdamame\nPork & Ginger Soup\nAsahi Beer\nSalad\nChilli\n\nOpen HoursEveryday17:00 - 24:00FacilitiesEnglish MenuEnglish SpeakerTakes ReservationsAccepts Credit CardsGood for familiesGood for GroupsVegetarianWifiAlcoholParkingMusicWinter OnlyAddressAkakura, Myoko, Niigata 949-2111Phone Number09017743979HomepageEmail[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/restaurants/shikisaikan-hidanan/","title":"Shikisaikan Hidanan - Myoko Tourism","description":"Located in Arai road station. We mainly offer Soba noodles with local vegetable tempra. Our Myoko Yuki Ebi tempura is very popular.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nShikisaikan Hidanan - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenShikisaikan HidananPlaces to EatOpen Season: All YearPrice Range: from ￥800 - ￥2,000Located in Arai road station. We mainly offer Soba noodles with local vegetable tempra. Also Myoko Yuki Ebi tempura is very popular. These shrimps are grown in Myoko. Other dishes include a variety of different rice bowls, cold udon noodles in summer and hot pot udon in winter. We also have a local vegetable market.\nApart from January 1st we are open everyday!\nOpen HoursEveryday11:00AM - 7:30PMFacilitiesEnglish SpeakerTakes ReservationsAccepts Credit CardsGood for familiesGood for GroupsWifiNo SmokingWheelchair AccessibleParkingAll YearAddress58-1 Inoyama, Myoko, Niigata 944-0075Phone Number0255-70-5252Homepagehttp://park10.wakwak.com/~hidanan/Email[email protected]Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/three-city-guide/","title":"Three City Guide - Myoko Tourism","description":"Myoko, Joetsu and Itoigawa are extremely easy to get to and offer a diverse range of attractions and deep cultural experiences.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nThree City Guide - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenThree City GuideMyoko, Joetsu & Itoigawa three city guide\nConnected by road and rail the 3 cities of Myoko, Joetsu and Itoigawa are extremely easy to get to and offer a diverse range of attractions and deep cultural experiences.\nMyoko CityMyoko is famous for its rich nature and deep snow. A great place for hiking, mountain climbing and of course winter sports.Joetsu CityA large city, Joetsu is rich is history. A vast number of temples and shrines as well as many other important cultural and historical areas are located in the city. And of course, the famous cherry blossoms that bloom each spring.Itoigawa CityA coastal city that is famous for its fresh and delicious sea food. The area is also an important geological area and features some breath-taking areas of natural beauty.MYOKOMt MyokoTIMESTAMP 0:22 & 2:51Mt Myoko is the dormant volcano that looms over Myoko Kogen. The stunning mountain can be climbed from July through to early November before the snow sets in. The mountain is one of Japans 100 famous mountains. The climb is challenging and rewarding with beautiful panoramic views from the summit.\nMore InfoJOETSUTAKADA CASTLE SITE PARK CHERRY BLOSSOMSTIMESTAMP 0:38In early April each year over 4,000 cherry trees (Sakura) come to life and bloom their delicate, beautiful pink blooms in Takada Castle Site Park. The nighttime viewing at the park is one of the most famous and spectacular in the whole of Japan.More InfoITOIGAWATakanami-no-Ike Pond TIMESTAMP 0:54One of Itoigawas most stunning areas. This beautiful pond reflects the beautiful surrounds in its clear waters. The area has boat rentals, walking trails and a campground. A beautiful and peaceful area that is also great for photography!More InfoMYOKOKanzuriTIMESTAMP 1:10Kanzuri is a famous special seasoning paste made in Myoko and sold all over the world. The factory and shop can be visited all year round. In winter they lay the peppers on the fresh snow. This draws out the salt and bitterness from them. If you are in the area during winter, you may be able to see this now famous sight.More InfoJOETSUKasugayama ShrineTIMESTAMP 1:20Famous samurai Uesugi Kenshin worshipped at this shrine. You can meet his modern-day version when you visit the shrine and get your photo with him. As well as viewing the historical building and statues you can also walk to the top of Mt Kasuga and get some great views of the city.More InfoITOIGAWABenten-Iwa RockTIMESTAMP 1:41Formed by an underwater volcano this massive sacred rock looms over the coast and has long been worshipped by sailors who saw it as a representation of Ichikushima the goddess of the sea. The small lighthouse on the rock still functions and there is a small shrine on the rock dedicated to the goddess.More InfoITOIGAWACrab MarketTIMESTAMP 1:52Being a coastal city Itoigawa is famous for its fresh seafood. The roadside station is a particularly great place to stop off and try some fresh crab. The shipping boats line up to offload their fresh catch.More InfoMYOKOKimi no ITIMESTAMP 2:01This famous sake brewery has been making high quality sake since 1842. You can visit the brewery all year round. In the video we see them cooking the rice that will be used for making the sake. This is only done 2-3 times a year during the winter.More InfoJOETSUSekai-Kan Movie TheatreTIMESTAMP 2:15This is the oldest still running movie theatre in Japan. A 5min walk from Takada train station, this traditional movie theatre is a great place to watch some classic movies. This beautiful building with its stunning wooden ceiling oozes atmosphere.More InfoJOETSURyotei UkiyoTIMESTAMP 2:24A ryotei is a traditional high-class restaurant that represents the regions food culture. Ryotei Ukiyo is over 140 years old. The rooms in this historical building are beautiful and the history of the building and how it was used is amazing to hear if you can get a tour. The food is delicious & lunch requires no reservation.More InfoITOIGAWAFossa Magna MuseumTIMESTAMP 2:33The Fossa Magna museum tells the story of our planet and the birth of the Japanese islands. The huge collection of mineral and rock samples as well as fossils tells the geological story of the area.More InfoITOIGAWATanimura Art MuseumTIMESTAMP 2:43In summer you can view the beautiful gardens. The art museum is open all year round. One of the last buildings designed by famous brutalist architect Togo Murano the building is as interesting as the sculptures it holds. You may wonder why we didn’t show the sculptures in the video. That is because you are not allowed to capture an image of the heads of the Buddhist statues.More InfoFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/mt-myoko-mt-hiuchi-trails/","title":"Hiking Trails","description":"Information and hiking trails for climbing Mt Myoko and Mt Hiuchi. Detailed guides on the trails for these popular mountains.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nHiking Trails\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMt Myoko & Mt Hiuchi TrailsUpdated onJuly 8, 2024Hiking GuidesOne of Japan’s 100 famous mountains, Mt Hiuchi may be the most stunning mountain you will climb in Japan. Until you start ascending to the summit the climb is not strenuous if you are of moderate fitness. You will hiking through the covered forest and then the open plateau area until you climb the steps up-to the peak of Mt Hiuchi. You can complete this hiking trail in one day. We would recommend you start early around 7AM. If you are reasonably fit you can expect to reach the top in 4.5hrs. Descending will take a lot less. If time allows you should spend the night in the mountain hut or camp ground and then climb to the peak early the next morning. You will need to book the hut if you wish to stay there.\nMt Myoko is an exciting mountain to climb. The hiking trail can also be tough if you don’t properly pace yourself. The course is steep from beginning to end with not many areas allowing you to take it easy. The climb to the summit is the most exciting part of the climb. You will ascend via chains which are hammered into the rocks. Don’t be put off by this as it’s easier than it may sound and the climb is traversed by school children and elderly climbers each year.\nYou will need to climb via chains and take several narrow paths which have breathtaking views. Once you get to the top don’t just stop at the first peak, you can walk across to the second peak which is more open and is great place to have your lunch and a rest. From the summit you can see the entire region, all the way to the Sea of Japan. On a clear day you can also see Mt Fuji as you climb to the top.\nPlease note that you can also climb from and return to Akakura Kanko Resort. Please check the map below for the path that heads in that direction.\nMt Myoko and Mt Hiuchi are connected via a hiking trail allowing you to climb both mountains. This is two day climb and you will need to decide if you will stay at Kurosawa hut or Koya Pond hut. In either case you should book the huts in advance. You can also camp at each hut which doesn’t need advance booking. Usually you would stop at Kurosawa hut but if you have a good pace you can also decide to finish at Koya Pond hut on your first day.\nYour entrance and exit point will be different but you could also return along the same route on your way down from Mt Hiuchi, back to Tsubame Onsen. In our course below you will start at Tsubame Onsen and exit at Sasagamine. Of course you could do this in reverse. In this case you would most likely stay at Koya pond hut and then descend via Mt Myoko on the second day.\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/sasagamine-trails/","title":"Sasagamine trails - Myoko Tourism","description":"There are many trails you can walk in Sasagamine. Here are a few of the popular courses.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSasagamine trails - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSasagamine trailsUpdated onJuly 9, 2024Hiking GuidesThis trail is very popular in spring when the skunk cabbages bloom in the wetland areas. Yumemidaira which means dream, view and flat land is covered with blooming skunk cabbages with Mt Mitahara in the background. You start this trail from the carpark of the rest house hut and first cross Sasagamine dam and Lake Otomi. After walking across the impressive dam you will climb a steep stairway that is probably the difficult part of this trail. After the stairs you will be in the forest and from here the trail is mostly flat and is suitable for all levels of fitness.\nThere are some interesting points of interest on this trail besides the main attraction of Yumemidaira. First you will come across Inari Shrine which is a small woodland shrine nestled between large Japanese oak trees. On the return from Yumemidaira you will also pass Shobu Pond which is a small wetland area that is full of skunk cabbages in spring. Zumi tunnel is a narrow path way lined with crab apples that you will need to crouch in order to pass through.\nThere is also a larger looped course that you can see on the map below. You will need to be careful to turn at the correct point to head to Yumemidaira otherwise you might end up doing the much longer trail.\nA great trail for a half day walk that is suitable for all levels. The trail starts from Sasagamine Green House which is also a great place for lunch after you finish. From there you will walk down the road and then through the forest. Sennin Pond is a great scenic spot in spring and autumn. If you visit on a good day the reflections in the pond are amazing.\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/golf/madarao-toukyu-golf-club/","title":"Madarao Toukyu Golf Club - Myoko Tourism","description":"Madarao Toukyu Golf Club is a large and varied course offering a different challenge at each hole.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMadarao Toukyu Golf Club - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMadarao Toukyu Golf ClubMyoko Golf CoursesUpdated onJuly 2, 2024Madarao Toukyu Golf ClubIntroductionMadarao Toukyu Golf Club is a large and varied course offering a different challenge at each hole.\nHomepage (JP)About Madarao Toukyu Golf Club\nMadarao Toukyu Golf Club is literally a game of two halves. The course is split in half offering very different challenges on both sides. On the first 9 holes you will drive up on your cart through thick dense birch forests until you come out on the top of the hill overlooking the resort below and with magnificent views of Mt Myoko directly in front of you. You will need some good accuracy and strategy for these first 9 holes.With each hole you will gradually work your way back down the hillside until you return to the main resort area which is where you play the final 9 holes. These holes are flatter and more open offering a different experience and play style challenge to the first 9.Tangram resort also offers accommodation as well as facilities such as baths and restaurants. They also have a variety of family activities that even young children can enjoy.\nHoles: 18PAR: 72Length: 5,993 ydsPRICE: From 5,900 JPYCredit Card: YesCart: YesLunch Included: NoClub Rental: YesDriving Range: NoPutting Green: YesChipping Area\n: NoPhone: 026-258-3673website: https://www.tokyu-golf-resort.com/madarao/Madarao Toukyu Golf Club Prices & Bookingt is best to book in advance to guarantee your tee off time. Please ask your lodge or booking agent to help you arrange your slot. Madarao Toukyu Golf Club offers the most competitive prices amongst all the courses in the Myoko area.\n \n\n\n\nWeekday\nFrom 5,900 JPY\n\n\nWeekend\nFrom 7,900 JPY\n\n\n\nMadarao Toukyu Golf Club GalleryFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/golf/myoko-kogen-golf-club/","title":"Myoko Kogen Golf Club - Myoko Tourism","description":"Myoko Kogen Golf Club is a highland resort style course located at the foot of Mt Myoko which offers stunning views of both Mt Myoko and Mt Kurohime during play.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMyoko Kogen Golf Club - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMyoko Kogen Golf ClubMyoko Golf CoursesUpdated onJune 24, 2024Myoko Kogen Golf ClubIntroductionMyoko Kogen Golf Club is a highland resort style course located at the foot of Mt Myoko which offers stunning views of both Mt Myoko and Mt Kurohime during play.\nHomepage (JP)About Myoko Kogen Golf Club\nMyoko Kogen Golf Club is a highland resort style course located at the foot of Mt Myoko which offers stunning views of both Mt Myoko and Mt Kurohime during play. The course has a very different look and style to all the other courses in Myoko. All the holes are framed by dense trees which gives the feeling you are playing through a forest. This is a very popular course amongst golfers and can be busy at times.\nIt should be noted that Myoko Kogen Golf Club offer online booking in English on their website (the only resort to do so) which makes it very easy and convenient for foreign visitors to play here without relying on their lodge to help assist with booking.\nThe club house has a restaurant, shop, bathrooms, locker rooms, private rooms and more. You can enjoy lunch with the view of the golf course. There are private rooms for after-competition-partys and meetings.\nMyoko Kogen Golf Club practice range has 15 lanes that are 280 yards-long. There is also an approach-practice field and a bunker field for customers to use to improve their golf technique.\nHoles: 18PAR: 72Length: 6,957 ydsPRICE: From 7,490 JPYCredit Card: YesCart: YesLunch Included: NoClub Rental: YesDriving Range: YesPutting Green: YesChipping Area\n: YesPhone: 0255-86-4812Email: http://www.myokokogen-gc.jp/mk_inquiry.htmlwebsite: http://www.myokokogen-gc.jp/index.htmlMyoko Kogen Golf Club Prices & BookingMyoko Kogen Golf Club are the only course in Myoko to offer online booking in English. Visit the booking page HERE to make a booking enquiry.\nYou can also book via phone if you need a quicker reply, but you may not get an English speaker (0255-86-4812)\nPrices on the left are weekday and on the right are for weekends.\nDuring self play period all facilities at the club such as restaurant and bathrooms are closed.\n \n\n\n\nEarly SeasonOpen – Mid July\n7,490 JPY\n10,990 JPY\n\n\nSeasonMid July – End Oct\n7,990 JPY\n12,990 JPY\n\n\nSeason EndNov 1st – 7th\n6,990 JPY\n10,990 JPY\n\n\nSelf PlayNov 8th – Close\n4,000 JPY\n5,000 JPY\n\n\n\nMyoko Kogen Golf Club GalleryFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/golf/akakura-golf-course/","title":"Akakura Golf Course","description":"Akakura Golf Course extends from the foot of Mt. Myoko. The course has stunning panoramic views of Mt. Myoko, Mt. Kurohime, and Mt. Madarao from every hole.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nAkakura Golf Course\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenAkakura Golf CourseMyoko Golf CoursesUpdated onJune 24, 2024Akakura Golf CourseIntroductionAkakura Golf Course extends from the foot of Mt. Myoko. The course has stunning panoramic views of Mt. Myoko, Mt. Kurohime, and Mt. Madarao from every hole.\nHomepage (JP)About Akakura Golf Course\nAkakura course extends from the foot of Mt. Myoko, one of the 100 famous mountains in Japan. The course has stunning panoramic views of Mt. Myoko, Mt. Kurohime, and Mt. Madarao from every hole.\nThe plateau style course is flows through birch and white oak trees, surrounding you with nature while you play through the dynamically designed course.\nThe white sand filled bunkers glisten in the sun and are some of the few in Japan. The contrast with the beautifully manicured green grass makes the course not only visually stunning but also helps the bunkers stand out.\nAkakura Golf Course uses a 5-seater electromagnetic induction cart. These advanced carts automatically drive themselves through the course, so you don’t need to worry about steering and driving them on your own.\nThe course changes through the seasons, so you can enjoy the cool breezes of summer or play surrounded by the colourful leaves of autumn. Here is what you can expect though out the year.\n・ Golf course opens between late April to early May.・ May: Enjoy the beauty of the remaining snow and fresh greeny on Mt. Myoko.・ June: The turf turns green.・ August: Play in the cool Myoko summer climate.・ From mid-October: Play in the beautiful autumn colors.・ Mid-November: Closed through winter due to snow.\nThe current course was designed in 1971 by master golf course craftsman Seiichi Inoue who has designed some of the best courses in Japan. At that time 9 holes were added, and the existing 9 holes were remodelled, and the course became the current 18-hole golf course. The design features highly strategic spacious fairways that make the most of nature, trees, ponds, and bunkers that are typical of a plateau style course.\nInoue’s instructions stated that “the natural topography around the green and fairway should be utilized and a modeling method that blends in with the natural environment as much as possible should be adopted.” As a result of this design and method of construction the course feels very natural and part of its surrounding environment.\nHoles: 18PAR: 72Length: 6,481 ydsPRICE: From 10,600 JPYCredit Card: YesCart: YesLunch Included: NoClub Rental: YesDriving Range: NoPutting Green: YesChipping Area\n: YesPhone: 0255-87-2502Email: N/Awebsite: http://www.akr-golf.com/Course MapAkakura Golf Course Prices & BookingYou need to book in advance to play. Currently Akakura Golf Course only offers online booking in Japanese so you will help from your booking agent or hotel to help you book. You can also call to book on: 0255-87-2502\nPrices shown on the left are for weekdays and weekends on the right. If you are a guest of Kanko Hotel then you will get a discount for ‘Season’ & ‘High Season’ play.\nThere are also rates (roughly half price) for half play of 9 holes. Caddy hire is also available: 4Bags 4,400 JPY, 3Bags 4,950 JPY, 2Bags 7,150 JPY, 1Bag 14,300 JPY.\n \n\n\n\nEarly SeasonOpen – May 14th\n7,500 JPY\n11,500 JPY\n\n\nSeasonMay 15th – Oct 31st\n10,600 JPY\n16,800 JPY\n\n\nHigh SeasonAugust 11th – 13th\n11,200 JPY\n–\n\n\nLate SeasonNov 1st – Close\n7,500 JPY\n11,500 JPY\n\n\n\nAkakura Golf Course GalleryFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/golf/myoko-country-club/","title":"Myoko Country Club - Myoko Tourism","description":"Myoko Country Club is an 18 hole parkland style course situated at an altitude of 700m at the foot of Mt Myoko.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMyoko Country Club - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMyoko Country ClubMyoko Golf CoursesUpdated onJune 24, 2024Myoko Country ClubIntroductionMyoko Country Club is an 18 hole parkland style course situated at an altitude of 700m at the foot of Mt Myoko.\nHomepage (JP)About Myoko Country Club\nMyoko Country Club is an 18-hole course that opened in 1964 and was designed by Canadian Ernie Brown. The parkland style course is situated at an altitude of 700m at the foot of Mt Myoko which provides a stunning backdrop to every hole on this beautiful course.\nThe course can be a nice challenge as the fairways gently slope and have fine undulations that make you think about each shot. The greens also feature a tough challenge as they are built around the naturally occurring slope of the area. However, once you learn to read them putting becomes great fun as you use the lines of the green.\nThe club house has a great restaurant where you can enjoy both breakfast and lunch as well as a variety of drinks. Lunch is included with most rounds.\nMyoko Country Club closes from December to mid-April due to the snowfall in winter.\nHoles: 18PAR: 72Length: 5,954 ydsPRICE: From 7,080 JPYCredit Card: YesCart: YesLunch Included: YesClub Rental: YesDriving Range: NoPutting Green: YesChipping Area\n: NoPhone: 0255-82-3141Email: [email protected]website: https://www.myoko-cc.jp/Course MapMyoko Country Club Prices & BookingYou need to book in advance to play. Currently Myoko Country Club only offers online booking in Japanese so you will help from your booking agent or hotel to help you book.\nPrices vary month by month and even day to day. For an accurate idea of prices please visit the pricing page HERE. If you match the symbol for the day to the pice below you can easily find the cost to play.\n \n\n\n\nWeekdays\n7,080 – 7,980 JPY\n\n\nWeekends & Holidays\n10,480 – 13,480 JPY\n\n\n\nMyoko Country Club GalleryFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/golf/apa-resort-joetsu-myoko-forest-golf-course/","title":"Apa Resort Joetsu Myoko Forest Golf Course - Myoko Tourism","description":"APA Resort Joetsu Myoko Forest Golf Course is situated in beautiful countryside and can challenge good players with a high degree of strategy.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nApa Resort Joetsu Myoko Forest Golf Course - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenApa Resort Joetsu Myoko Forest Golf CourseMyoko Golf CoursesUpdated onJune 24, 2024Apa Resort Joetsu Myoko Forest Golf CourseIntroductionApa Resort Joetsu Myoko Forest Golf Course is situated in beautiful countryside and can challenge good players with a high degree of strategy.\nHomepage (JP)About Apa Resort Joetsu Myoko Forest Golf Course\nApa Resort Joetsu Myoko Forest Golf Course is an 18-hole golf course situated in beautiful countryside which can challenge good players with a high degree of strategy. For guests staying at Apa Resort you can start your round of golf directly from outside the hotel. In August 2007, Apa Resort introduced an 18-hole electromagnetic induction golf cart, which allows guests to easily and comfortably enjoy their round of golf.There is plenty more enjoyment to be had at Apa Resort after your round of golf. The resort has some amazing baths for you to relax in as well as a stunning restaurant that serves delicious food.\nCedar Course\n(9 holes, 3,510 yards, par 36)A graceful mainly flat course that is best to attack from the middle of the fairway on the first shot.\nPine Course\n(9 holes, 3,449 yards, par 36)Requires more offensive golf as this side is more undulating, featuring many raised and lower areas.\nHoles: 18PAR: 72Length: 6,959 ydsPRICE: From 7,500 JPYCredit Card: YesCart: YesLunch Included: YesClub Rental: YesDriving Range: NoPutting Green: YesChipping Area\n: NoPhone: 0255-82-4111Email: N/Awebsite: https://www.apahotel.com/resort/myoko/golf/play.htmlApa Resort Joetsu Myoko Forest Golf Course Prices & BookingYou need to book in advance to play. Currently Apa Resort only offers online booking in Japanese so you will help from your booking agent or hotel to help you book.\nApa Resort are also actively encouraging junior golf and children aged U16 can play 1 round [with lunch] on weekdays from 3,000 yen.\n \n\n\n\nWeekdays\nFrom 7,500 JPY\n\n\nWeekends & Holidays\nFrom 10,800 JPY\n\n\n\nApa Resort Joetsu Myoko Forest Golf Course GalleryFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/narita-to-myoko/","title":"Narita Airport to Myoko by train","description":"Get to Myoko from Narita airports by train. A detailed guide with useful links to help you.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nNarita Airport to Myoko by train\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenNarita – MyokoUpdated onSeptember 4, 2024TrainsStep OneApprox 1hrTake the NEX Narita Express train from the airport to JR Tokyo StationStep TwoApprox 1.5hrsCatch the Shinkansen from Tokyo Station to NaganoStep ThreeApprox 40minTake the local train from Nagano Station to Myoko Kogen.You want to take the Hokuriku line to Nagano station. The train usually departs from platform 22 or 23 but be sure to check. The journey can take between 1.5hrs and 2hrs. The final train is usually around 10PM.You can buy a reserved seat or a non reserved seat. Tickets are purchased from a ticket machine near the entrance gate to the Shinkansen line. If you cant find the ticket machine please ask a member of staff. The machines are available in English. First you choose your train line, you will need to choose the Hokuriku line. Then you choose Nagano station and select the number of passengers.Your ticket will have your car number and seat number printed on it. You can check the side of the train to see where the respective seating is. Usually non-reserved is toward the back of the train.All cars are non-smoking.Get off the shinkansen and take the escalator up to the main station area. You will need to exit through the gates in order to buy a ticket for the local train. You may need to ask one of the attendants which platform is bound for Myoko. In side the train station there is a tourist office should you need help and advice.Tickets can also be purchased on the train or upon arrival to Myoko station. In this case there is no need to exit the station area. You can follow the sign to the local train platforms and directly board the train for Myoko. Some times you will only have 5-10 minutes to catch the local train. If this is the case you should directly board the local train and purchase your ticket onboard or at Myoko.Download PDF Guide                                         HANEDA   AIRPORT   NARITA   AIRPORT     Tokyo Monorail      Myoko Tourism     www.myokotourism.com                                                                                                                                                                        JR EAST   HOKURIKU SHINKANSEN      JR Yamanote Line     7 min       JR Keihin-Tohoku Line     4 min      Shinano Railway (local train)     Echigo Tokimeki Railway (local train)     45 min     35 min     Keisei Skyliner     JR Narita Express (NEX)      13 - 21min depending on terminal     You can use the Japan Rail Pass       53min depending on terminal     You can use the Japan Rail Pass     Seats must be reserved before boarding      41min depending on terminal     You CAN NOT use the Japan Rail Pass     You CAN NOT use the Japan Rail Pass     You CAN NOT use the Japan Rail Pass     Seats must be reserved before boarding      1.5hrs - 2hrs depending on train     You can use the Japan Rail Pass                       TOKYO   STATION   UENO   STATION             NAGANO   STATION   JOETSU-MYOKO   STATION   Hamamatsucho   Station   MYOKO KOGEN   STATION                    Narita Airport WebsiteFind Bullet Trains TimesBook Bullet TrainsNagano - Tokyo TrainsFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/haneda-to-myoko/","title":"Haneda Airport to Myoko by train","description":"Get to Myoko from Haneda airport by train. A detailed guide with useful links to help you.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nHaneda Airport to Myoko by train\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenHaneda – MyokoUpdated onSeptember 4, 2024TrainsStep OneApprox 15minTake the Tokyo Monorail from Haneda Airport to Hamamatsucho Station.Step TwoApprox 5minTransfer to the Yamanote Line and catch the train to Tokyo StationStep ThreeApprox 1.5hrsCatch the Shinkansen from Tokyo Station to Nagano.Step FourApprox 40minTake the local train from Nagano Station to Myoko Kogen.You want to take the Hokuriku line to Nagano station. The train usually departs from platform 22 or 23 but be sure to check. The journey can take between 1.5hrs and 2hrs. The final train is usually around 10PM.You can buy a reserved seat or a non reserved seat. Tickets are purchased from a ticket machine near the entrance gate to the Shinkansen line or directly from the ticket desk if you cant find the ticket machine. The machines are available in English. First you choose your train line, you will need to choose the Hokuriku line. Then you choose Nagano station and select the number of passengers.Your ticket will have your car number and seat number printed on it. You can check the side of the train to find the correct car. Usually non-reserved is toward the back of the train.All cars are non-smoking.Upon arriving in Nagano take the escalator up to the main station area. You will need to exit through the gates in order to buy a ticket for the local train. Inside the train station there is a tourist office should you need help and advice.Tickets can also be purchased on the train or upon arrival to Myoko station. In this case there is no need to exit the station area. You can follow the sign to the train platform and directly board the train for Myoko. Some times you will only have 5-10 minutes to catch the local train. If this is the case you should directly board the local train and purchase your ticket onboard or at Myoko.Download PDF Guide                                         HANEDA   AIRPORT   NARITA   AIRPORT     Tokyo Monorail      Myoko Tourism     www.myokotourism.com                                                                                                                                                                        JR EAST   HOKURIKU SHINKANSEN      JR Yamanote Line     7 min       JR Keihin-Tohoku Line     4 min      Shinano Railway (local train)     Echigo Tokimeki Railway (local train)     45 min     35 min     Keisei Skyliner     JR Narita Express (NEX)      13 - 21min depending on terminal     You can use the Japan Rail Pass       53min depending on terminal     You can use the Japan Rail Pass     Seats must be reserved before boarding      41min depending on terminal     You CAN NOT use the Japan Rail Pass     You CAN NOT use the Japan Rail Pass     You CAN NOT use the Japan Rail Pass     Seats must be reserved before boarding      1.5hrs - 2hrs depending on train     You can use the Japan Rail Pass                       TOKYO   STATION   UENO   STATION             NAGANO   STATION   JOETSU-MYOKO   STATION   Hamamatsucho   Station   MYOKO KOGEN   STATION                    Haneda Airport WebsiteFind Bullet Trains TimesBook Bullet TrainsNagano - Tokyo TrainsFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/nagano-tokyo-train-timetable/","title":"Nagano/Tokyo train times","description":"Time tables of all the trains to and from Nagano and Tokyo.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nNagano/Tokyo train times\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenNagano - Tokyo Train TimetablesUpdated onJuly 30, 2024Train Guide★ Suspension of service on Saturdays, Sundays and public holidays\n☆ Operation only on Saturdays, Sundays, and public holidays\nShinano Railway fare Nagano – Myoko Kogen: ¥850\nNon-reserved seats (Hakutaka/Asama): ¥7,810\nReserved seats (Kagayaki/Hakutaka/Asama): ¥8,540\n*Kagayaki bullet trains are all reserved seats.\nFrom Myoko to Nagano/Tokyo\n\n\n\nFrom Myoko\nTo Tokyo\n\n\n Shinano Railway Kita-shinano Line\nConnection to JR Hokuriku Shinkansen (Bullet Train) \n\n\n\n\nDepart Myoko Kogen \nArrive Nagano\nTrain No.\nDepart Nagano\nArrive Tokyo \n\n\n6:02\n6:50\nHakutaka552\n7:45\n9:20\n\n\n6:52\n7:37\nKagayaki502\n8:10\n9:32\n\n\n-\n-\nAsama610\n8:26\n10:12\n\n\n7:49\n8:34\nKagayaki504\n8:58\n10:20\n\n\n-\n-\nHakutaka554\n9:02\n10:36\n\n\n-\n-\nAsama612\n9:26\n11:12\n\n\n-\n-\nHakutaka556\n10:02\n11:36\n\n\n9:28\n10:14\nKagayaki508\n10:56\n12:20\n\n\n-\n-\nHakutaka558\n11:02\n12:36\n\n\n-\n-\nAsama614\n11:28\n13:12\n\n\n10:52\n11:35\nHakutaka560\n12:26\n13:52\n\n\n-\n-\nAsama616\n12:29\n14:12\n\n\n★ 11:46\n12:30\nHakutaka562\n13:23\n14:52\n\n\n☆ 12:00\n12:40\nHakutaka564\n14:26\n15:52\n\n\n13:06\n13:49\nHakutaka566\n15:22\n16:52\n\n\n-\n-\nAsama622\n15:25\n17:12\n\n\n14:45\n15:33\nAsama624\n15:42\n17:20\n\n\n-\n-\nHakutaka568\n16:20\n17:52\n\n\n15:50\n16:38\nAsama626\n16:25\n18:12\n\n\n-\n-\nKagayaki510\n17:05\n18:28\n\n\n-\n-\nAsama628\n17:10\n18:40\n\n\n16:41\n17:25\nHakutaka570\n17:37\n19:12\n\n\n-\n-\nKagayaki512\n17:56\n19:20\n\n\n17:11\n17:55\nHakutaka572\n18:25\n20:00\n\n\n18:12\n18:56\nKagayaki514\n19:05\n20:23\n\n\n-\n-\nAsama630\n19:09\n20:52\n\n\n-\n-\nHakutaka574\n19:41\n21:16\n\n\n19:14\n19:57\nKagayaki516\n20:29\n21:56\n\n\n-\n-\nHakutaka576\n20:35\n22:12\n\n\n19:53\n20:37\nAsama632\n21:17\n23:08\n\n\n20:55\n21:39\nHakutaka578\n21:49\n23:24\n\n\n22:06\n22:49\nKagayaki518\n22:11\n23:32\n\n\n\nFrom Tokyo to Nagano/Myoko\n\n\n\nFrom Tokyo\nTo Myoko\n\n\nConnection fromJR Hokuriku Shinkansen (Bullet Train)\nShinano RailwayKita-shinano Line\n\n\n\n\nTrain No.\nDepartTokyo\nArriveNagano \nDepartNagano\nArriveMyoko Kogen\n\n\n-\n-\n-\n 6:00\n 7:45\n\n\n-\n-\n-\n 6:23\n 7:07\n\n\n-\n-\n-\n 7:45\n 8:30\n\n\nHakutaka551\n6:28\n8:06\n-\n-\n\n\nAsama601\n6:52\n8:40\n-\n-\n\n\nKagayaki503\n7:20\n8:40\n-\n-\n\n\nAsama603\n7:24\n9:12\n9:23\n10:10\n\n\nHakutaka553\n7:52\n9:30\n-\n-\n\n\nKagayaki505\n8:36\n9:56\n-\n-\n\n\nHakutaka555\n8:44\n10:17\n-\n-\n\n\nAsama605\n9:04\n10:41\n★ 10:49\n11:34\n\n\nKagayaki507\n9:20\n10:44\n☆ 10:53\n11:33\n\n\nHakutaka557\n9:32\n11:06\n-\n-\n\n\nAsama607\n9:44\n11:33\n-\n-\n\n\nKagayaki523\n9:56\n11:18\n-\n-\n\n\nAsama635\n10:08\n11:38\n-\n-\n\n\nKagayaki509\n10:24\n11:41\n-\n-\n\n\nHakutaka559\n10:32\n12:04\n12:11\n12:58\n\n\nAsama609\n11:04\n12:46\n☆ 13:05\n13:47\n\n\nHakutaka561\n11:24\n12:49\n13:16\n14:05\n\n\nAsama611\n12:04\n13:51\n-\n-\n\n\nHakutaka563\n12:24\n13:53\n14:15\n14:59\n\n\nAsama613\n13:04\n14:46\n-\n-\n\n\nHakutaka565\n13:24\n14:49\n15:23\n16:07\n\n\nAsama615\n14:04\n15:51\n-\n-\n\n\nHakutaka567\n14:24\n15:54\n16:07\n16:54\n\n\nAsama617\n15:04\n16:46\n-\n-\n\n\nHakutaka569\n15:24\n16:50\n17:06\n17:53\n\n\nAsama619\n15:52\n17:41\n18:08\n18:55\n\n\nHakutaka571\n16:32\n18:07\n-\n-\n\n\nAsama621\n16:52\n18:38\n18:47\n19:32\n\n\nKagayaki513\n17:24\n18:47\n-\n-\n\n\nAsama623\n17:32\n19:16\n-\n-\n\n\nHakutaka573\n18:04\n19:40\n-\n-\n\n\nKagayaki515\n18:24\n19:44\n19:50\n20:35\n\n\nAsama625\n18:40\n20:24\n-\n-\n\n\nHakutaka575\n19:04\n20:51\n21:10\n21:55\n\n\nAsama627\n19:32\n21:11\n-\n-\n\n\nKagayaki539\n19:56\n21:16\n-\n-\n\n\nHakutaka577\n20:12\n21:53\n22:03\n22:47\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/joestu-myoko-station-train-times/","title":"Joetsu Myoko Station train time table","description":"Time table for trains to and from Joetsu Myoko shinkansen train station and also to Naoetsu Station.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nJoetsu Myoko Station train time table\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenJoetsu Myoko Train TimesUpdated onJuly 5, 2024Train GuideMyoko Kogen to Joetsu & Naoetsu\n\n\n\nMyoko Haneuma Line\n \n \n \n \n \n \n \n \n\n\n\n\nMyoko Kogen\n05:59\n07:11\n08:01\n08:44\n9:44\n10:20\n12:07\n13:01\n\n\nSekiyama\n06:08\n07:19\n08:10\n08:54\n09:53\n10:30\n12:16\n13:10\n\n\nNihongi\n06:16\n07:27\n08:21\n09:02\n10:01\n10:38\n12:24\n13:17\n\n\nArai\n06:24\n07:37\n08:36\n09:10\n10:10\n10:46\n12:32\n13:26\n\n\nKita Arai\n06:28\n07:41\n08:39\n09:14\n-\n10:50\n12:36\n13:30\n\n\nJoetsu Myoko Station\n06:36\n07:47\n08:45\n09:20\n10:19\n10:57\n12:41\n13:35\n\n\nTakada\n06:43\n07:53\n08:52\n09:33\n10:26\n11:04\n12:47\n13:42\n\n\nNaoetsu\n06:52\n08:03\n09:01\n09:42\n10:35\n11:13\n12:57\n13:52\n\n\n\n\n\n\n\nMyoko Haneuma Line\n \n \n \n \n \n \n \n \n \n\n\n\n\nMyoko Kogen\n15:09\n16:01\n17:06\n18:00\n18:35\n19:17\n19:48\n20:58\n22:12\n\n\nSekiyama\n15:19\n16:09\n17:15\n18:08\n18:44\n19:26\n20:01\n21:06\n22:20\n\n\nNihongi\n15:30\n16:19\n17:23\n18:16\n18:52\n19:34\n20:09\n21:14\n22:28\n\n\nArai\n15:38\n16:29\n17:31\n18:35\n19:09\n19:45\n20:18\n21:22\n22:36\n\n\nKita Arai\n15:42\n16:33\n17:35\n18:39\n19:13\n19:49\n20:22\n21:26\n22:40\n\n\nJoetsu Myoko Station\n15:47\n16:37\n17:40\n18:44\n19:23\n19:56\n20:27\n21:31\n22:46\n\n\nTakada\n15:53\n16:43\n17:47\n18:54\n19:30\n20:03\n20:34\n21:38\n22:52\n\n\nNaoetsu\n16:03\n16:53\n17:56\n19:03\n19:39\n20:12\n20:43\n21:47\n23:01\n\n\n\nJoetsu & Naoetsu to Myoko Kogen\n\n\n\nMyoko Haneuma Line\n \n \n \n \n \n \n \n \n \n\n\n\n\nNaoetsu\n05:06\n05:59\n06:52\n07:42\n08:12\n08:43\n09:44\n11:35\n12:38\n\n\nTakada\n05:15\n06:09\n07:02\n07:54\n08:21\n08:52\n09:53\n11:44\n12:47\n\n\nJoetsu Myoko Station\n05:21\n06:16\n07:10\n08:01\n08:28\n09:00\n10:02\n12:08\n13:09\n\n\nKita Arai\n05:25\n06:20\n07:13\n08:05\n08:31\n-\n10:06\n12:12\n13:13\n\n\nArai\n05:29\n06:24\n07:18\n08:10\n08:36\n09:10\n10:13\n12:15\n13:25\n\n\nNihongi\n05:37\n06:32\n07:29\n08:19\n08:45\n09:19\n10:21\n12:26\n13:34\n\n\nSekiyama\n05:46\n06:40\n07:37\n08:27\n08:53\n09:28\n10:29\n12:34\n13:42\n\n\nMyoko Kogen\n05:54\n06:49\n07:46\n08:36\n09:01\n09:37\n10:38\n12:43\n13:51\n\n\n\n\n\n\n\nMyoko Haneuma Line\n \n \n \n \n \n \n \n \n\n\n\n\nNaoetsu\n14:26\n15:27\n16:34\n17:06\n18:03\n18:45\n19:39\n21:00\n\n\nTakada\n14:43\n15:36\n16:43\n17:16\n18:12\n18:54\n19:49\n21:09\n\n\nJoetsu Myoko Station\n14:50\n16:01\n16:51\n17:24\n18:20\n19:02\n20:02\n21:31\n\n\nKita Arai\n14:54\n16:05\n16:54\n17:27\n18:23\n19:05\n20:06\n21:35\n\n\nArai\n15:00\n16:09\n16:58\n17:32\n18:27\n19:09\n20:17\n21:39\n\n\nNihongi\n15:10\n16:17\n17:07\n17:41\n18:36\n19:18\n20:25\n21:47\n\n\nSekiyama\n15:18\n16:25\n17:15\n17:49\n18:44\n19:26\n20:34\n21:56\n\n\nMyoko Kogen\n15:27\n16:34\n17:24\n17:57\n18:53\n19:35\n20:42\n22:04\n\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/snowshoe/","title":"Snowshoe - Myoko Tourism","description":"Myoko is a great place to explore on snowshoes. Wonder deep in to pristine forests, up the mountain or to a waterfall. Hire a guide or grab some snowshoes and explore by yourself.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSnowshoe - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSnowshoeUpdated onJuly 11, 2024WinterSnowshoe RentalsYou can hire snowshoes from the following rental shops.\nAoyama (Akakura & Shin Akakura) 1 Day rental at 2,500yen 10sets available\nDancing Snow (Shin Akakura) 1 Day rental with poles at 3,000yen 15 sets available. High quality Tubbs snowshoes.\nVisitor Center near Imori Pond (Ikenotaira) 1 Day rental 1,500yen 15 sets available.\nSnowshoe TourSnowshoe CoursesFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/akakura-onsen-ski-resort/","title":"AKAKURA ONSEN SKI RESORT - Myoko Tourism","description":"Akakura Onsen Ski Resort is a large resort made up of 3 main areas, Yodel, Kumado and Ginrei. There are plenty of different courses suitable for all levels of skier and boarder.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nAKAKURA ONSEN SKI RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenAKAKURA ONSEN SKI RESORTUpdated onOctober 23, 2024Ski Resorts\nAkakura Onsen Ski Resort is a large resort made up of 3 main areas, Yodel, Kumado and Ginrei. There are plenty of different courses suitable for all levels of skier and boarder. It is connected to the neighbouring Akakura Kanko Resort and a joint pass can be purchased. Akakura Onsen is also the only resort in Myoko to offer night time skiing. The night time ski area can be found at the Kumado area on the far end of the resort (see map). The resort has terrain parks, offers back country skiing and has child friendly areas for young children to safely play in.\nResort Info\n\n\n\nElevation\nBase elevation: 650 meters Summit elevation: 1,200 meters Vertical drop: 550 meters\n\n\nNumber of courses\n17\n\n\nLongest run\n3000 meters\n\n\nLifts\nQuad chairs: 2 Triple chairs: 4 Pair lifts: 8\n\n\nGradient\nMaximum: 38 degrees\n\n\nNight skiing\nAvailable\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 50%, Intermediate 30%, Advanced 20%\n\n\n\n\nHOMEPAGEOpen Period: Dec 14 - March 30Open Time: 8:30 - 22:00Resort FacilitiesOpen EverydayNight SkiingSki SchoolTerrain ParkBack CountryRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nTicket\nAdult\nSenior & 13-15\nUnder 13\nNotes\n\n\n\n\n1daypassport\n7,500円\n6,000円\n2,300円\n8:30 - 21:00(Fri,Sat to 10PM)\n\n\n1 Day\n6,000円\n4,800円\n2,000円\n8:30〜17:00\n\n\n5 Hr\n5,500円\n4,400円\n1,500円\n \n\n\nNight\n3,200円\n3,200円\n1,100円\n17:00 - 21:00(Fri,Sat to 10PM)\n\n\n1 Time\n800円\n \n\n\n\n\n \n\n\n\n\nPass\nAdult\nSenior/U13\n\n\n\n\nAkakura All Mountain1 Day\n8,000yen\n6,400yen\n\n\n\n\nRental Prices\n\n\n\n \n1 Day\n2 Days\n3 Days\n\n\n\n\nSki/Snowboard Set\n4,000yen (3,500yen)\n7,000yen (5,000yen)\n9,000yen (7,000yen)\n\n\nSki/Snowboard\n3,000yen (2,000yen)\n4,500yen (3,500yen)\n6,000yen (4,500yen)\n\n\nBoots\n2,000yen (1,500yen)\n3,000yen (2,500yen)\n4,000yen (3,500yen)\n\n\nWear\n4,000yen (3,000yen)\n7,000yen (5,500yen)\n10,000yen (7,500yen)\n\n\nHelmet\n1,500yen\n-\n-\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/akakura-kanko-resort/","title":"AKAKURA KANKO RESORT - Myoko Tourism","description":"Akakura Kanko Resort (also known as ‘Akakan’) was one of the first European-style ski resorts in Japan. The resort was established in 1937 and is one of the most popular resorts in Myoko.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nAKAKURA KANKO RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenAKAKURA KANKO RESORTUpdated onDecember 10, 2024Ski Resorts\nAkakura Kanko Resort (also known as ‘Akakan’) was one of the first European-style ski resorts in Japan. The resort was established in 1937 and is one of the most popular resorts in Myoko. The famous Kanko hotel is situated half way up the mountain on the ski slopes and offers a true ski in ski out experience. The resort is connected with the neighbouring Akakura Onsen ski resort and a joint ticket which allows use of both courses is available for purchase. The resort has slopes that cater to all levels of abilty from beginner to expert.\nResort Info\n\n\n\nElevation\nBase elevation: 740 meters Summit elevation: 1,500 meters Vertical drop: 760 meters\n\n\nNumber of courses\n10\n\n\nLongest run\n4500 meters\n\n\nLifts\nGondolas: 1 Quad chairs: 6\n\n\nGradient\nMaximum: 32 degrees\n\n\nNight skiing\nNot available\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 40%, Intermediate 30%, Advanced 30%\n\n\n\n\nHOMEPAGEOpen Period: Dec 14 - May 6Open Time:  8:30 – 4:30Resort FacilitiesOpen EverydaySki SchoolTerrain ParkBack CountryRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nPass\nAdult\nSenior & 13-15\nUnder 13\n\n\n\n\n4 Hour\n￥5,000\n￥4,500\n￥3,500\n\n\n1 Day\n￥6,500\n￥5,400\n￥4,800\n\n\n2 Day\n￥11,500\n￥9,000\n￥8,000\n\n\n3 Day\n￥16,000\n￥12,000\n￥11,000\n\n\n\n\nPre school children ski free.\nRental Prices\n\n\n\n \n1 Day\n2 Days\n3 Days\n\n\n\n\nSki/Snowboard Set\n4,500yen (3,500yen)\n7,500yen (6,000yen)\n11,000yen (8,500yen)\n\n\nSki/Snowboard\n3,500yen (2,500yen)\n6,000yen (4,500yen)\n8,500yen (5,500yen)\n\n\nBoots\n2,000yen (1,500yen)\n3,000yen (2,500yen)\n4,000yen (3,500yen)\n\n\nWear\n4,500yen (3,500yen)\n7,500yen (6,000yen)\n11,000yen (8,500yen)\n\n\nHelmet\n800yen\n1,600yen\n2,400yen\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/suginohara-ski-resort/","title":"SUGINOHARA SKI RESORT - Myoko Tourism","description":"Myoko Suginohara ski resort has two zones, the Suginohara Zone and the Mitahara Zone. The resort also has one of the longest run in Japan of 8.5km!","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSUGINOHARA SKI RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSUGINOHARA SKI RESORTUpdated onDecember 10, 2024Ski Resorts\nMyoko Suginohara ski resort has two zones, the Suginohara Zone and the Mitahara Zone. The resort also has one of the longest run in Japan of 8.5km! The large resort has a variety of slopes suitable for all levels and abilities. The top of the resort has some great snow and some excellent tree runs. There is also a great ski park. The resort also had snowmobiles available to ride. The resort offers free skiing for children all season long which makes it a great resort for families.\nResort Info\n\n\n\nElevation\nBase elevation: 731 meters Summit elevation: 1,855 meters Vertical drop: 1,124 meters\n\n\nNumber of courses\n17\n\n\nLongest run\n8500 meters\n\n\nLifts\nGondolas: 1 Quad chairs: 2 Pair lifts: 2\n\n\nGradient\nMaximum: 38 degrees\n\n\nNight skiing\nNot available\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 40%, Intermediate 40%, Advanced 20%\n\n\n\n\nHOMEPAGEOpen Period: Dec 23 - March 24Open Time: 8:30 – 4:00Resort FacilitiesOpen EverydaySki SchoolTerrain ParkBack CountryRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nPass\nAdult\nSenior/Student\n\n\n\n\n1 Day\n￥7,000\n￥6,400\n\n\n2 Day\n￥13,000\n￥12,000\n\n\n4 Hours\n￥6,200\n￥5,700\n\n\n\n\nSeniors (55+) & Students (13-15) reduced ticket fee.Children under 13 ski for free.Parking is free on weekdays.Weekends & New Year parking 1000yen.\nRental Prices\n\n\n\n \n1 Day\n2 Days\n\n\n\n\nSki/Snowboard Set\n5,000yen (4,000yen)\n8,500yen (7,000yen)\n\n\nWear Set\n4,500yen (3,500yen)\n7,500yen (6,000yen)\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/alpen-blick-ikenotaira-onsen-ski-resort/","title":"ALPEN BLICK IKENOTAIRA ONSEN SKI RESORT - Myoko Tourism","description":"Ikenotaira Onsen Ski Resort is split in to two areas. The central area has a long wide slope. The bottom half of the slope is wide and reasonably gentle. This is a great slope to learn on.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nALPEN BLICK IKENOTAIRA ONSEN SKI RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenALPEN BLICK IKENOTAIRA ONSEN SKI RESORTUpdated onOctober 23, 2024Ski Resorts\nIkenotaira Onsen Ski Resort is split in to two areas. The central area has a long wide slope. The bottom half of the slope is wide and reasonably gentle. This is a great slope to learn on. As the slope is so wide it never feels over crowded. Ikenotaira also has a great snow park (one of the best in Japan), and some truly huge jumps are constructed each year. The left side of the resort (Alpenblick slope) has shorter runs and more ungroomed snow as well as plenty of opportunities to get into the wooded areas and hit untouched snow.\nResort Info\n\n\n\nElevation\nBase elevation: 740 meters Summit elevation: 1,500 meters Vertical drop: 760 meters\n\n\nNumber of courses\n10\n\n\nLongest run\n4000 meters\n\n\nLifts\nQuad chairs: 1 Pair lifts: 5\n\n\nGradient\nMaximum: 30 degrees\n\n\nNight skiing\nNot available\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 40%, Intermediate 45%, Advanced 15%\n\n\n\n\nHOMEPAGEOpen Period: Dec 14 - March 30Open Time: 8:30 – 4:30Resort FacilitiesOpen EverydaySki SchoolTerrain ParkRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nPASS\nADULT\nU13\nSENIOR\n\n\n\n\n1 Day\n￥5,600\n￥3,400\n￥4,800\n\n\n2 Day\n￥10,100\n￥6,100\n￥8,600\n\n\n4 hour\n￥4,500\n￥2,700\n￥3,900\n\n\n1 Time\n￥800\n￥500\n￥700\n\n\n\n\nRental Prices\n\n\n\n \n1 Day\n2 Days\n3+ Days\n\n\n\n\nSki/Snowboard Set\n5,000yen (3,900yen)\n8,800yen (6,600yen)\n+3,300yen (2,200yen)\n\n\nSki/Snowboard\n3,300yen (2,500yen)\n5,200yen (4,100yen)\n+1,700yen (1,,00yen)\n\n\nBoots\n2,500yen (1,900yen)\n4,100yen (3,000yen)\n+1,500yen (900yen)\n\n\nWear\n5,000yen (3,900yen)\n8,800yen (6,600yen)\n+3,300yen (2,200yen)\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/arai-snow-resort/","title":"ARAI MOUNTAIN RESORT - Myoko Tourism","description":"Located in Niigata Prefecture, Lotte Arai Resort in Myoko lies just one hour 46 minutes from Tokyo by Bullet Train and two hours from Niigata Airport. Lotte Arai Resort awaits you amidst a scenic landscape of mountains, stretching outward to the ocean from Mt. Myoko, and a broad expanse of countryside.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nARAI MOUNTAIN RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenARAI MOUNTAIN RESORTUpdated onNovember 25, 2024Ski Resorts\nLocated in Niigata Prefecture, Lotte Arai Resort in Myoko lies just one hour 46 minutes from Tokyo by Bullet Train and two hours from Niigata Airport. Lotte Arai Resort awaits you amidst a scenic landscape of mountains, stretching outward to the ocean from Mt. Myoko, and a broad expanse of countryside.\nAll 257 rooms at Lotte Arai Resort are open to both long and short-stay guests. On the premises, you will find 14 ski courses and first-class leisure activities, including eight areas of ungroomed snow, spas, pools, restaurants, cafes, function rooms, and a 1501 meter zip tour – the longest in Asia.\nThe resort’s ski season embodies the excitement of a winter wonderland, while the “green season” offers fresh, clean mountain air and nature in full bloom. Here, you will find year-round fun and relaxation for all. Our goal is to be the premium mountain resort in Asia and we are eager to introduce the world to the beauty of both Mt. Okenashi and the Joetsu region.\nResort Info\n\n\n\nElevation\nBase elevation: 329 meters Summit elevation: 1,280 meters Vertical drop: 951 meters\n\n\nNumber of courses\n15 + 8 free ride zones\n\n\nLongest run\n5200 meters\n\n\nLifts\nGondolas: 1, Quad lift: 2, Pair lift: 2\n\n\nGradient\nMaximum: 46 degrees\n\n\nNight skiing\nFrom 16:30 - 20:00\n\n\nForeign language support\nAvailable\n\n\nTerrain\nBeginner 25%, Intermediate 45%, Advanced 30%\n\n\n\n\nHOMEPAGEOpen Period: Dec 14 - May 11Open Time: 8:30 – 21:00Resort FacilitiesOpen EverydayNight SkiingSki SchoolTerrain ParkBack CountryRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nTicket type\nAdult\nOver 60\n7 to 18\n\n\n\n\nSanroku PassLifts available: Sanroku Lift No. 1 / Sanroku Lift No. 2\n￥4,000\n￥3,700\n￥3,000\n\n\n4-hour Pass (11:00 a.m.~)\n￥6,000\n￥5,500\n￥4,000\n\n\n1-Day Ticket\n￥7,500\n￥7,000\n￥5,000\n\n\n2-Day Ticket\n￥14,500\n￥13,500\n￥9,500\n\n\n3-Day Ticket\n￥21,500\n￥20,000\n￥14,000\n\n\n4-Day Ticket\n￥28,500\n￥26,500\n￥18,500\n\n\n5-Day Ticket\n￥35,500\n￥33,000\n￥23,000\n\n\n6-Day Ticket\n￥42,500\n￥39,500\n￥27,500\n\n\n7-Day Ticket\n￥49,500\n￥46,000\n￥32,000\n\n\n\n\nRental Prices\n\n\n\nRental Sets\nAfternoon Rental(12:00 - 17:00)\nOne Day\nEach additional day\n\n\nOver13 years old\nUnder12 years old\nOver13 years old\nUnder12 years old\nOver13 years old\nUnder12 years old\n\n\n\n\nStandard Set（Skis+Poles+Boots/Snowboard+Boots）\n¥4,000\n¥3,000\n¥5,500\n¥4,000\n¥5,000\n¥3,500\n\n\nSingle-product(Skis+Poles/Snowboard)\n¥3,000\n¥2,000\n¥4,000\n¥3,000\n¥3,500\n¥2,500\n\n\nBoots （Ski boots /Snowboard boots）\n¥1,500\n¥1,000\n¥2,500\n¥2,000\n¥2,000\n¥1,500\n\n\nWear Set(Jacket+Pants)\n¥3,000\n¥2,000\n¥4,000\n¥3,000\n¥3,500\n¥2,500\n\n\nHigh-end Set(Skis+Poles+Boots/Snowboard+Boots)* High-end set: Boots are standard.\n¥5,500\n¥7,500\n¥7,000\n\n\nHigh-end Single-product (Skis,Poles,Boots/Snowboard,Boots)\n¥4,000\n¥5,500\n¥5,000\n\n\nUpgrade(Skies/Snowboard)\n-\n¥2,000\n¥2,000\n\n\nHigh-end Ski boots\n¥3,000\n¥4,000\n¥3,500\n\n\nHigh-End Snowboard Binding\n¥2,000\n¥3,000\n¥2,500\n\n\nSki poles\n¥500\n¥1,000\n¥800\n\n\nHelmet\n¥500\n¥1,000\n¥800\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/madarao-mountain-resort/","title":"MADARAO MOUNTAIN RESORT - Myoko Tourism","description":"Madarao Mountain Resort sits on the border of Niigata and Nagano prefectures. Half of Madarao Mountain Resort falls with in Iiyama city in Nagano while some of the slopes fall with in Myoko City. Madarao is becoming well known for its ungroomed courses which more advanced skiers and boarders love.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMADARAO MOUNTAIN RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMADARAO MOUNTAIN RESORTUpdated onOctober 23, 2024Ski Resorts\nMadarao Mountain Resort sits on the border of Niigata and Nagano prefectures. Half of Madarao Mountain Resort falls with in Iiyama city in Nagano while some of the slopes fall with in Myoko City. Madarao is becoming well known for its ungroomed courses which more advanced skiers and boarders love. Mt Madarao provides amazing views of Mt Myoko and the surrounding mountain range. On a clear day, the view is spectacular. Madarao shares the mountain with neighbouring Tangram Ski Circus and you can purchase a joint ticket which will allow you to ski the whole mountain.\nMadarao Mountain Resort offers night skiing on Saturdays and over the New Year.\nResort Info\n\n\n\nElevation\nBase elevation: 910 meters Summit elevation: 1,350 meters Vertical drop: 440 meters\n\n\nNumber of courses\n31\n\n\nLongest run\n2500 meters\n\n\nLifts\nQuad lifts: 2 Triple lifts: 4 Pair lifts: 5 Single lifts: 1 Other: 3\n\n\nGradient\nMaximum: 36 degrees\n\n\nNight skiing\nAvailable\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 30%, Intermediate 40%, Advanced 30%\n\n\n\n\nHOMEPAGEOpen Period: Dec 14 - March 30Open Time: 8:30 – 17:00Resort FacilitiesOpen EverydayNight SkiingSki SchoolTerrain ParkBack CountryRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nPass\nAdult\nSenior & 13-18\nU13\n\n\n\n\n7 Hours\n￥7,700\n￥7,000\n￥4,900\n\n\n14 Hours\n￥14,000\n￥13,300\n￥9,100\n\n\nNight\n￥3,000\n￥2,500\n￥2,000\n\n\n1 Time\n￥700\n￥700\n￥700\n\n\nKids Park\n￥500\n￥500\n￥500\n\n\n\n\nMADARAO MOUNTAIN PASSFor joint use of both Madarao and Tangram Ski Resorts.\n\n\n\nPass\nAdult\nSenior\nU13\n\n\n\n\n1 Day\n￥8,000\n￥7,500\n￥5,000\n\n\n\nNight: 5:00pm – 9:00pm\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/tangram-ski-circus/","title":"TANGRAM SKI CIRCUS - Myoko Tourism","description":"Tangram Ski Circus is a great family resort and is also great for beginners and intermediate skiers and snowboarders. The resort is reasonably small but it neighbours with Madarao resort and a joint ticket can be purchased. This then opens the whole mountain for some amazing skiing and boarding. On clear days, you can get outstanding views of Lake Nojiri and Mt Myoko from the top of the resort.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nTANGRAM SKI CIRCUS - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenTANGRAM SKI CIRCUSUpdated onDecember 10, 2024Ski Resorts\nTangram Ski Circus is a great family resort and is also great for beginners and intermediate skiers and snowboarders. The resort is reasonably small but it neighbours with Madarao resort and a joint ticket can be purchased. This then opens the whole mountain for some amazing skiing and boarding. On clear days, you can get outstanding views of Lake Nojiri and Mt Myoko from the top of the resort.\nThe resort is well equipped for children and has a playground and nursery facilities. This makes it amazing for families as parents can leave their children with the nursery staff and everybody can have a great day.\nTangram Ski Circus also offers snowmobiling and snow rafting. Night Skiing is also available on Saturdays.\nResort Info\n\n\nElevation\nBase elevation: 800 meters Summit elevation: 1,320 meters Vertical drop: 520 meters\n\n\nNumber of courses\n14\n\n\nLongest run\n2500 meters\n\n\nLifts\nQuad chairs: 2 Double chairs: 3\n\n\nGradient\nMaximum: 35 degrees\n\n\nNight skiing\nAvailable\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 30%, Intermediate 40%, Advanced 30%\n\n\n\nHOMEPAGEOpen Period: Dec 21 - March 30Open Time: 8:30 – 16:30Resort FacilitiesOpen EverydayNight SkiingSki SchoolRentalChildren's FacilitiesCourse MapResort StatsTicket Prices\n\n\n\nPass\nAdult\nSenior\nU13\n\n\n\n\n1 Day\n￥6,000\n￥5,500\n￥3,700\n\n\n4 Hour\n￥5,000\n￥4,500\n￥3,200\n\n\nNight\n￥2,500\n￥2,500\n￥2,500\n\n\nChildren 4-6 ￥1,000\n\n\n\n \nMADARAO MOUNTAIN PASSFor joint use of both Madarao and Tangram Ski Resorts.\n\n\n\n\nPass\nAdult\nSenior\nU13\n\n\n\n\n1 Day\n￥8,000\n￥7,500\n￥5,000\n\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/seki-onsen-ski-resort/","title":"SEKI ONSEN SKI RESORT - Myoko Tourism","description":"Seki Onsen is a small ski resort with just 2 lifts that is famous for having some the best snow in the whole of Japan. Seki Onsen is well known for its heavy snowfall and deep powder snow. The resort gets so much snow that it is often open until the beginning of May, long after the other resorts have all closed.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSEKI ONSEN SKI RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSEKI ONSEN SKI RESORTUpdated onDecember 10, 2024Ski Resorts\nSeki Onsen is a small ski resort with just 2 lifts that is famous for having some the best snow in the whole of Japan. Seki Onsen is well known for its heavy snowfall and deep powder snow. The resort gets so much snow that it is often open until the beginning of May, long after the other resorts have all closed. The runs are usually not groomed leaving a lot of powder snow for skiers and boarders to enjoy. While there are some areas suitable for beginners this is usually a resort that more advanced skiers and boarders head to, in order to enjoy some of the world’s best powder snow.\nResort Info\n\n\n\nElevation\nBase elevation: 900 meters Summit elevation: 1,210 meters Vertical drop: 310 meters\n\n\nNumber of courses\n4\n\n\nLongest run\n1500 meters\n\n\nLifts\nPair lifts: 1 Single lifts: 1\n\n\nGradient\nMaximum: 38 degrees\n\n\nNight skiing\nNot available\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 20%, Intermediate 50%, Advanced 30%\n\n\n\n\nHOMEPAGEOpen Period: TBAOpen Time: 9:00 – 17:00Resort FacilitiesOpen EverydayTerrain ParkBack CountryRentalCourse MapResort StatsResort VideoTicket Prices\n\n\n\nPass\nAdult\nU13\n\n\n\n\n1 Day\n￥4,000\n￥3,000\n\n\nAfternoon\n￥3,200\n￥2,200\n\n\n1 Time\n￥500\n￥200\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/myoko-ski-park-resort/","title":"MYOKO SKI PARK RESORT - Myoko Tourism","description":"Myoko Ski Park Resort is a small resort with 2 courses. It is suited to beginners and familes. The slightly more advanced course cuts through the trees. The courses are not very long and the resort is suitable for those who want a more relaxed skiing experience and those who are learning. The resort is usually not crowded.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nMYOKO SKI PARK RESORT - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenMYOKO SKI PARK RESORTUpdated onJuly 14, 2024Ski Resorts\nMyoko Ski Park Resort is a small resort with 2 courses. It is suited to beginners and familes. The slightly more advanced course cuts through the trees. The courses are not very long and the resort is suitable for those who want a more relaxed skiing experience and those who are learning. The resort is usually not crowded.\nResort Info\n\n\n\nElevation\nBase elevation: 724 meters Summit elevation: 860 meters Vertical drop: 136 meters\n\n\nNumber of courses\n2\n\n\nLongest run\n1200 meters\n\n\nLifts\nPair lifts: 1\n\n\nGradient\nMaximum: 15 degrees\n\n\nNight skiing\nNot available\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 60%, Intermediate 40%, Advanced 0%\n\n\n\n\nHOMEPAGEOpen Period: CLOSEDOpen Time: CLOSEDResort FacilitiesOpen EverydaySki SchoolRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nPass\nAdult\nU13\n\n\n\n\n1 Day\n￥2,500\n￥2,000\n\n\n4 Hour\n￥2,000\n￥1,500\n\n\n5 Hour\n￥2,200\n￥1,700\n\n\n1 Time (set of 10)\n￥2,500\n￥2,000\n\n\n1 Time\n￥300\n￥250\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-resorts/kyukamura-myoko-runrun/","title":"KYUKAMURA MYOKO RUNRUN - Myoko Tourism","description":"Kyukamura Myoko RunRun is a very small resort. It is a single small slope that is most suited for beginners and families with small children. The course is short and pretty gentle making it a good slope for first time skiers and boarders.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nKYUKAMURA MYOKO RUNRUN - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenKYUKAMURA MYOKO RUNRUNUpdated onOctober 23, 2024Ski Resorts\nKyukamura Myoko RunRun is a very small resort. It is a single small slope that is most suited for beginners and families with small children. The course is short and pretty gentle making it a good slope for first time skiers and boarders.\nResort Info\n\n\n\nElevation\nBase elevation: 800 meters Summit elevation: 900 meters Vertical drop: 100 meters\n\n\nNumber of courses\n1\n\n\nLongest run\n900 meters\n\n\nLifts\nPair lifts: 1\n\n\nGradient\nMaximum: 16 degrees\n\n\nNight skiing\nNot available\n\n\nForeign language support\nNot available\n\n\nTerrain\nBeginner 100%, Intermediate 0%, Advanced 0%\n\n\n\n\nHOMEPAGEOpen Period: Dec 23 - March 24Open Time: 9:30 – 16:30Resort FacilitiesOpen EverydayRentalChildren's FacilitiesCourse MapResort StatsResort VideoTicket Prices\n\n\n\nPass\nAdult\nU13\n\n\n\n\n1 Day\n￥2,500\n￥2,000\n\n\n4 Hours\n￥1,800\n￥1,200\n\n\n1 Time (set of 9)\n￥1,800\n￥1,200\n\n\n1 Time\n￥250\n￥200\n\n\n\n\nMapFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/akakura-first-tracks/","title":"Akakura First Tracks CAT Tour","description":"AKAKURA FIRST TRACKS program is an all-day event geared for participants with strong intermediate skills who want to experience the Myoko backcountry.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nAkakura First Tracks CAT Tour\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenCAT Tours with THUNDERBIRDPresented by THUNDERBIRDAn introduction to backcountryIntro to Backcountry Skiing & RidingExperience the thrill of backcountry snow sports at a relaxed pace – perfect for families, couples, friends, first-time backcountry enthusiasts. Visit our website to see all our tours and options.Note: This is a beginner-friendly experience designed for those new to backcountry skiing and riding. Our focus is on fun, safety, and creating great memories with your loved ones.INCLUSIONS / CONTENTS OF INTRO TOURAbout the  tour\nEarly morning start \nBackcountry Orientation\n5 untracked runs by snowcat on private slopes\nSet your own comfortable pace\nLocated just 15 minutes from Akakura\n\nBOOKINGHow to bookTHUNDERBIRDPN: 090-5582-4453E-Mail: [email protected]\nSend us an email enquiry to arrange a booking.\nVisit Our webisteAKAKURA FIRST TRACKS CONDITIONS & REFUNDAt the discretion of the lead guide, we reserve the right to modify the itinerary due to weather, snow conditions, or according to group skill level. For best results, be honest with yourself about your fitness level and skiing/riding competency. If the departure is cancelled, expect a refund less actual costs.Refund Policy:45 days out: 100% refund,30 days out: 50% refund,15 days out: 0% refund.Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/hikarigahara-cat-tours/","title":"HIKARIGAHARA CAT TOURS","description":"Hikarigahara Cat Tours head to some of the best hidden powder slopes in the area. You will get to experience untouched deep powder.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nHIKARIGAHARA CAT TOURS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenHIKARIGAHARA CAT TOURSUpdated onAugust 22, 2024CAT ToursHikarigahara Snow Cat ToursTake a snow cat tour to some of the best hidden powder slopes in the area. You will get to experience untouched deep powder that nobody else has access to. Hikarigahara Cat Tours experienced guides will help you enjoy the best of the backcountry safely. Depending on weather and other conditions you should expect to be able to get in five to seven runs during one tour.\nThese untracked slopes are about 2,000m with good gradients that make them great for skiing and boarding. Our guides will find the best slopes to suit you, so you have a great experience in the backcountry.\nVisit their websiteIMPORTANT NOTEThere is no shuttle to Hikarigahara. You will need to arrange your own transport to the base at Kamisekida. See map.Conditions of Participation\nBring your own transceiver. (If you need to rent from us, rental transceiver will be 3,000yen at the tour base.)\nDuring the tour day, you must obey the instructions of the guide.\nThe schedule may change depending on the conditions and the weather.\nPlease note that the number of runs during the tour cannot be guaranteed because the conditions and the weather.\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2025 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/by-car/","title":"By car to Myoko","description":"How to get to Myoko by car. By using the expressways its very easy to reach Myoko from all major cities.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nBy car to Myoko\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenBy CarUpdated onJune 19, 2024AccessHow to access Myoko by carEach year more and more foreign visitors access Myoko via car. If you do happen to have your own transport or rent a car getting to Myoko is actually pretty easy. I would recommend using the highways, but bear in mind these are not free. They are all toll roads. If you are using google maps or another navigation tool make sure you turn on use toll roads. The highways are usually not busy once you are out of the major city areas so your journey should be pretty smooth. Make sure you keep an eye out for the correct junction. If you miss your turn you may have to travel 15-20 min before you can come off and turn around.Guide to traveling to Myoko via carFrom TokyoRoute\n\nTokyo to Nagano: Start your journey on the Kan-Etsu Expressway (E17) towards Niigata. Continue for approximately 140 kilometers until you reach the Fujioka Junction.\nNagano to Myoko Kogen: At the Fujioka Junction, switch to the Joshin-Etsu Expressway (E18) and head towards Nagano. Follow the expressway for about 160 kilometers. Exit at the Myoko-Kogen Interchange and follow the signs to Myoko Kogen.\n\nTips\n\nEstimated Travel Time: Around 4 hours, depending on traffic and road conditions.\nTolls: Be prepared for toll fees, which can be paid via ETC (Electronic Toll Collection) for quicker passage.\nRest Stops: Utilize service areas along the Kan-Etsu and Joshin-Etsu expressways for breaks and refreshments.\n\nFrom NagoyaRoute\n\nNagoya to Nagano: Depart from Nagoya on the Chuo Expressway (E20) heading towards Matsumoto. Continue on this route for approximately 230 kilometers until you reach the Okaya Junction.\nNagano to Myoko Kogen: At the Okaya Junction, merge onto the Nagano Expressway (E19) and proceed towards Nagano for about 60 kilometers. Transition to the Joshin-Etsu Expressway (E18) at Nagano and drive towards Myoko. Exit at the Myoko-Kogen Interchange and follow the signs to Myoko Kogen.\n\nTips\n\nEstimated Travel Time: Approximately 5 hours, varying with traffic conditions.\nTolls: Ensure you have cash or an ETC card for toll payments along the Chuo and Nagano expressways.\nScenic Routes: Enjoy the picturesque landscapes along the Chuo Expressway, especially around the Kiso Valley and the Japanese Alps.\n\nFrom OsakaRoute\n\nOsaka to Nagoya: Begin your drive on the Meishin Expressway (E1) heading east towards Nagoya. Travel for roughly 170 kilometers until you reach the Komaki Junction.\nNagoya to Nagano: From the Komaki Junction, transition to the Chuo Expressway (E20) and follow the same route as described from Nagoya, continuing to Nagano.\nNagano to Myoko Kogen: Merge onto the Nagano Expressway (E19) at Okaya Junction, then onto the Joshin-Etsu Expressway (E18) towards Myoko. Exit at the Myoko-Kogen Interchange and follow the signs to Myoko Kogen.\n\nTips\n\nEstimated Travel Time: Around 6-7 hours, depending on traffic and driving speed.\nTolls: Prepare for multiple tolls along the Meishin, Chuo, and Nagano expressways. ETC cards are recommended for convenience.\nRest Stops: Take advantage of service areas such as the Lake Biwa Service Area for breaks and to enjoy local specialties.\n\n\nFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/backcountry/","title":"Backcountry - Myoko Tourism","description":"safely enjoy the Myoko backcountry with an experienced guide who can show you the best off piste areas to safely enjoy the best powder snow Myoko has to offer.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nBackcountry - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenBackcountry ToursIn-FieldIn-Field are fully licensed backcountry tour guides. You are guaranteed to be guided by a licensed professional who knows not only the best areas and tracks but also how to keep you safe.Dancing SnowYou don’t have to be an expert skier to enjoy your backcountry adventure with Dancing Snow. Their guides can cater your experience to your ability and fitness level.Powder ReconThe first western guiding company established in Myoko, Powder Recon have been operating in Japan providing guiding services for well over a decade.Japan Snow SportsJapan Snowsports is an international snow school based in Madarao. They are a group of highly qualified instructors with many years of experience.Follow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/ski-schools/","title":"Ski Schools - Myoko Tourism","description":"Book a lesson for adults and children of all levels at one of Myokos many ski schools. Take a lesson from a highly qualified professional instructor.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nSki Schools - Myoko Tourism\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenSki SchoolsUpdated onAugust 30, 2024WinterMyoko SnowsportsMyoko Snowsports are the biggest snowsports school in the Myoko area. They are also the official ski school for Lotte Arai Resort. Myoko Snowsports offer a wide range of courses for both adults and children and cater to all levels of ability from beginner to expert. Experience the best of Myoko’s skiing and snowboarding with one of their resident professional instructors. You will build your confidence and progress your skills while being guided around the wealth of terrain Myoko has to explore. Choose from group and private program options.Website Yodel Snow SchoolYodel snow school was established in 1960 and is the oldest snow school in Myoko. They offer professional snowboard and ski training as well as back-country and snow-shoe courses. Yodel snow school have lessons for both adults and children and for all levels of ability. If you want to get off the ski runs try out their guided off-piste tours or snow-shoeing tour. If you want to push yourself try out their race training or take an international ski test to see how good you are.Website Canyons MyokoCanyons Myoko strive to provide the best snow experiences in Japan. Their international crew of professional instructors will ensure you a fantastic Myoko experience, whether you are a first timer or a seasoned veteran. Offering exclusively private lessons, the undivided attention of our highly qualified instructors means that you truly get the most out of your time in Myoko with lessons tailor-made for you. Morning, afternoon, and full-day lessons are available.\n\nAll our prices include up to 6 guests per lesson.WebsiteEscape Myoko Ski SchoolExperience the best Myoko has to offer with Escape Myoko! Whether you're a beginner or an advanced rider, our certified instructors provide personalized coaching to help you build confidence and master new techniques on the slopes. We offer private lessons tailored to your needs and preferences. For those interested in pursuing a career in snow sports, we also provide NZSIA-certified ski and snowboard instructor courses. Additionally, our resort guiding services are perfect for first-time visitors looking to explore the best runs and hidden powder stashes. Book your lesson today and experience the very best that Myoko has to offer!Website Japan SnowsportsJapan Snowsports is an international snow school based in Madarao.  They are a group of highly qualified instructors with many years of experience. Japan Snowsports teach and guide on skis and snowboard, from first timers to expert level.WebsiteFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://myokotourism.com/rental-equipment/","title":"Rental Equipment","description":"Find the best places rental equipment; ski and snowboard equipment in Myoko.","language":"en-US"},"page_content":"\n\n\n\n\n\n\nRental Equipment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content\nSkip to footer\nPlacesStayEatActivitiesWinterAccessNewsContactOnsenRental EquipmentUpdated onJuly 9, 2024WinterMyoko SnowsportsMyoko Snowsports will have everything you could possibly need. They have a huge selection of skis, snowboards and ski wear for both young children and adults. They also stock large sized boots which are usually difficult to find in Japan. Their staff are all native English speakers and can give you expert advice on what equipment is best for you. They have skis and snowboards for all types of use, from on-piste beginners to freestyle and powder skis and snowboards.WebsiteAoyama SportsAoyama have 3 stores in the Akakura Onsen area. They have an online reservation system so you can book your equipment in advance. You can also receive a discount by doing this. They have equipment for all levels and stock brand name skis and boards from Burton, K2, Zuma and many more. They also offer an overnight waxing service for your skis and snowboard.WebsiteGo Myoko RentalsGo Myoko Rentals is situated in the heart of Myoko with our shop at Hotel Taiko in Akakura Onsen. Offering high quality rental equipment, you can find everything you need for your snow adventures at Go Myoko Rentals. Rental costs start from 3,000yen for a half day and 4,000yen for a full day and from as little as 2,000yen for kids.WebsiteLotte Arai ResortWe offer ski and snowboard gear rental.\nIn addition to carrying all sizes, from child to adult, as well as a variety of colors and designs from Salomon, we also carry high end designs from a variety of brands. We want you to hit the slopes using the gear that suits you the best.\nSalomon Station at LOTTE ARAI RESORT is a member of the network of “S-B-B certified technicians” recommended by the Association of Japan Ski Promotion. WebsitePowder ReconPowder Recons skis and boards are available for hire, at a competitive rate. They are working together with Nordica skis to fully equip their rental store with the newest and best all mountain and powder skis on the market. Powder Recon is also working with Japanese powder snowboard makers, Green Lab and Japanese ski goggle brand, SWANS – designed to give you the very best visibility on the mountain. Their experienced ski techs will assist you with all your rental gear, making sure you get the best equipment for your ability. They also offer ski and snowboard waxing, as well as edge tune ups.WebsiteFollow me on FacebookFollow me on XFollow me on LinkedInToursKoya Pond HutGolf CoursesHikingBike RentalPlacesHotelsRestaurantsSnow ReportsSeason PassesSki ResortsSki SchoolsRental ShopsBackcountrySnowshoeCross CountryCAT ToursSnow MobileAccess GuideTrainsLocal BusesWinter BusesAirport ShuttlesTaxisCar RentalNewsletterWe send out a mail magazine 2-3 times a year. Sign up to recieve info about Myoko, events & news. \n\n\n\n\n\n\n\n\n\nSend\n \n\n\nWhatsAppOpen a chatEmail us[email protected]Copyright 2024 © Myoko Tourism \n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"https://shop.yuki-sato.jp/en/pages/snowmobiletours","title":"\n      YUKISATO Snowmobile Tours\n    ","description":"YUKISATO Snowmobile Tours is Japan's largest snowmobile backcountry field in the Joetsu-Myoko region. We offer tours that allow a wide range of people, from beginners to experienced riders, to enjoy snowmobiling. Please enjoy the course surrounded by beautiful trees and the panoramic view stretching out to the Sea of ​​Japan.","language":"en"},"page_content":"\n\n\n\n\n\n\n\n      YUKISATO Snowmobile Tours\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\nskip to content\n\n\n\n\n\n\n\n\n\n\n\n\n<tc>HOME</tc><tc>SNOWMOBILE\nTOURS</tc><tc>CONTACT US</tc>\n\naccount\n\n\n\n\n\n\n\n\ncart\n\n\n\n\n\nThere are no products in your cart.\n\n\n\n\n\n<tc>Now accepting reservations.</tc>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<tc>HOME</tc><tc>HOME</tc>\n<tc>SNOWMOBILE\nTOURS</tc><tc>SNOWMOBILE\nTOURS</tc>\n<tc>CONTACT US</tc><tc>CONTACT US</tc>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<tc>YUKISATO\nSNOWMOBILE TOURS</tc><tc>Wilderness Adventure</tc>\nFor more information\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<tc>YUKISATO\nSNOWMOBILE TOURS</tc><tc>YUKISATO Experience</tc>\nFor more information\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<tc>YUKISATO SNOWMOBILE\nTOURS</tc><tc>Twilight Tour</tc>\nFor more information\n\n\n\n\n\n\n\n\n\nYUKISATO Snowmobile Tours\nNow accepting reservations for tours.Open January 10, 2025\n*The start of operations may be delayed due to snow conditions.\nReservations for the 2025 tour are now being accepted.\n \nWe are very excited to announce the launch of one of the biggest snowmobile tour operations in Japan!\nYUKISATO Snowmobile Tours accommodates for riders of all abilities and experience, offering everyone the chance to explore the amazing Joetsu Myoko Area.\nOur tours are like no others - bigger terrain, longer riding time, and breathtaking views!\n \n \n\n\n\n\n\n\n\n\n\n\n\n 《  Tour overview 》 \n\n\n\n\n\n\n\n\n\n\n<tc>YUKISATO SNOWMOBILE TOURS</tc>Wilderness adventure\n\nThis tour is suited for first time riders and intermediate riders alike who want to discover snowmobiling in Japan. Friendly Guides will provide you with an unforgettable snowmobiling experience through the Okazawa forest no matter what your level.\n \nTour time: 9:00 / 11:00 / 13:00Duration: 1.5 hours ( excluding pick-up time )  Price: ¥24,000～\n \n\n<tc>Wilderness Adventure Details</tc>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<tc>YUKISATO SNOWMOBILE TOURS</tc><tc>YUKISATO Experience</tc>\n\nThis is a great tour for those wanting to experience more of the beautiful Okazawa area. We will take you further up into the forest where a snowshoeing or Yukiita experience can be enjoyed to take in the amazing scenery. Local beverages and snacks will also be provided.\nTour time: 9:00 / 13:00Duration: 2 hours ( excluding pick-up time )Price: ¥35,000～\n\n<tc>YUKISATO Experience Details</tc>\n\n\n\n\n\n\n\n\n\n<tc>YUKISATO SNOWMOBILE TOURS</tc><tc>Twilight Tour</tc>\n\n\nExperience the snowy winter twilight and the beautiful evening and night views of a place that can only be visited in winter. Hot beverages and a commemorative photo are included.\nTour time: Duration: 1.5 hours ( excluding pick-up time )Price: ¥35,000～\n\n\n<tc>Twilight Tour Details</tc>\n\n\n\n\n\n\n\n\n\n\n《 Tour map 》 \n\n《 Instagram 》 \n\n\n《 Access 》 \n\n\n\n\n\n\n\nAddress\n〒949-2322  1441-2 Okazawa, Nakago Ward, Joetsu City, Niigata Prefecture \n\n\nTrain access\n\n[Tokyo] JR Land Shinkansen (Tokyo - Joetsumyoko): about 1 hour 50 minutes\n[Nagano] JR Hokuriku Shinkansen (Nagano - Joetsumyoko): about 20 minutes\n[Toyama] JR Hokuriku Shinkansen (Toyama - Joetsumyoko): about 40 minutes\n※Rent a car or take a cab from Joetsu Myoko Station.To the venue: about 30 min.\n\n\n\n Car access \n\nJoshinetsu Expressway Nakago IC: 5 minutes\nJoshinetsu Expressway Arai Smart IC: 5 minutes\n\n\n\nNearby facilities\n Lotte Arai Resort : 9 minutes/car\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n　© STUDIO JAPAN Inc.\n\n© YUKISATO\nPowered by Shopify\n\n\n\n\n\n\n","type":"Document"}
{"id":null,"metadata":{"source":"GuestHouseInformation.txt"},"page_content":"﻿Greengreen Guesthouse\n\n\n\n\nWelcome to Greengreen Guesthouse! This property was purchased as an akia (abandoned house) in 2019 and restored with the aim of bringing back to life the original ambience of this 70’s era Japanese snow-country home. \n\n\nThe guesthouse has two floors and a basement.  Each floor has its own kitchen, bathroom, toilet and living area, and each can function as a self-contained two bedroom apartment sleeping up to 4 people.  \n\n\nThe basement has a communal dry room and Ski/Snowboard/Equipment storage area. The basement can also be used for Ski Tuning.\n\n\nGreengreen Guesthouse  is located in the village of Suginosawa, at the base of Mt Myoko and Suginohara Ski Resort.  Guests can access Suginohara Ski Resort via the Suginohara Romance Chair which is 200 meters from the guesthouse.\n\n\nPlease enjoy your stay at Greengreen Guesthouse!\n\n\n\n\n\n\nContact Information \nHosts:         Maki and Michael  \nEmail:         greengreenguesthouse@gmail.com \nMobile:         81 90 7210 2046  \nWhatsApp:         81 80 2569 3415 \nInstagram:         @greengreenguesthouse \nAddress:         1836-1 Suginosawa\n                Myoko, Niigata\n                949-2113\n\n\nEmergency Numbers\nFire/Ambulance:         119\nPolice:                110\n\n\n________________\n\n\nGuesthouse Information\n\n\nWifi\nName: GlocalNet OUVM7G\nPassword: 08570595\n\n\nHeating\nGas heaters are provided in all rooms. Please make an effort to keep warm while minimizing heater use by observing the following:\n* Put more clothes on!\n* Keep doors closed.\n* Gas heats rooms very quickly so there is no need to leave heaters on in empty rooms.\n* Operate heaters on the lowest temperature setting.  Heaters will function continuously at a gentle pace and keep the room at a comfortable temperature.\n* Hot water bottles are available.  These are great for warming the bed before you go to sleep and will continue  providing heat throughout the night.\n* Quality doonas and blankets are provided. You should be able to have a warm and comfortable sleep without leaving the heaters on overnight.\n* Please ensure all heaters are turned off whenever you leave the house.\n\n\n\n\nRubbish\nPlease divide rubbish into the following 3 groups:\n1. Burnable: All paper, plastics and anything dirty\n2. Recycle: Cans and bottles (Glass or plastic) cleaned, dried and labels removed.\n3. Compost: Raw fruit and vegetable scraps only please\n\n\nPlease put full rubbish bags under the steps in the basement.\n\n\nDry Room\nThere is a dry room available in the basement which operates on a timer system.\n\n\nEquipment Storage\nSki/snowboard rack locations:\n1. Outside, below the entrance.\n2. Immediately inside the entrance.\n3. In the basement (dry skis and snowboards only please)\n\n\nFeel free to use the basement area for storage of ski/snowboard bags and equipment.\n\n\nSki/Snowboard Tuning\nDane across the road offers an equipment tuning service. You can contact him via mobile or WhatsApp on 61467628666.\n\n\nFeel free to use the basement for ski and snowboard maintenance.  A workbench and clamps are available, as well as a dustpan and broom for cleaning up any mess😉.\n\n\n\n\nSnow Clearing\nWe will endeavor to keep access to and from the guesthouse clear of snow, however snow will often accumulate very quickly during a typical winter storm in Myoko! Feel free to join in on the snow clearing fun, grab the nearest shovel and clean the steps whenever you like ❄️😄!\n\n\n\n\n\n\n\n\n\n\n\n\nSuginosawa\nThe local village is named for the Japanese cedar trees (Sugi)  which dominate the surrounding hills, and the gully (sawa) which channels mountain water through the lower part of town.  Suginosawa is a traditional farming village which has existed for much longer than the adjoining Suginohara Ski Resort.  The village is surrounded by rice paddies and produces some of Japan’s (aka the worlds) best rice.  \n\n\nVillage Facilities\n* Onsen\n* Two Pines Pizza Restaurant \n* Ski/Snowboard rental - available at Two Pines Pizza\n* The Den Bar and Restaurant - delivery available via QR code \n* Shuttle bus service to/from Myoko Resorts \n* Local bus service \n* Convenience Store (basic supplies only) \n* Post office with ATM (international cards accepted) \n\n\nAll village facilities are within easy walking distance from Greengreen Guesthouse. \n\n\n________________\n\n\nPublic Transport\nFor access to Ikenotaira, Akakura Kanko and Akakura Onsen Ski Resorts, take the Mt Myoko Shuttle from the carpark in front of the fire station (on the main street diagonally opposite the onsen). Cost is ¥1,000 each way.\n\n\nMt Myoko Shuttle Timetable\n\n\n  \n\nA local bus service operates between Suginosawa and Myoko Kogen.  The closest bus stop is located on the main street in front of the onsen.\n\n\nLocal bus timetable","type":"Document"}
